index.org
#+TITLE: DON'T PANIC
#+AUTHOR: David Bjergaard
#+EMAIL: david.b@duke.edu
#+OPTIONS:   H:5 num:nil toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+STYLE:    <link rel="stylesheet" type="text/css" href="./css/style.css" />
#+LaTeX_CLASS: article
#+HTML_MATHJAX: align:"center" mathml:nil path:"../MathJax/MathJax.js"

* A Hitchhiker's guide to High Energy Physics
** Introduction
Welcome to High Energy Physics.  Like the Galaxy, HEP is a wonderful
and mysterious place filled with amazing things.  The intent of this
guide is to provide a jump-start to HEP research.  Its purpose is to
be entertaining and uninformative.  The information in this guide was
hard won, The Editor does not intend it to be different for our dear
reader.  This guide is not intended to make the reader's life easier.
It is not intended to teach anything.  It is intended to provide the
dear reader with a glossary of concepts for further research.

If the reader finds this guide entertaining, but uninformative, then
please send a bottle of Old Janx Spirit to The Editor. The Guide is
not intended to be read linearly.  Jump to the section in need, and if
that section contains links to other sections, then please see above
regarding edits. Prepare to be frustrated.

*** Navigating the guide
A note on key notation: Keys sequences follow the "emacs" style for
notating keys.  Therefore "=C-c=" means hold down the control key,
while pressing the =c= key. "=M-a=" would mean hold down the "Meta" key
and press the =a= key.  On most keyboards the Meta key is the key
labeled "Alt".  There is also the "Super" key, on most PC keyboards
this key has the "Windows icon" on it.  The function keys 1-12 are
notated as =F1= etc.  The escape key is usually notated =ESC=, and
the enter key is notated =RET= for Return.  A sequence is denoted by
a series of keys and spaces or dashes.  A dash means hold the two
keys at the same time, a space means release the previous keys and
continue with the next instruction.  Some examples:
- "=C-c C-a=" Control-C release Control-A
- "=C-c a=" Control-c release A
- "=C-M-f=" Press Control, then Meta, then F without releasing

The online version of the guide includes a Table of Contents; simply
mouse over it and a full list of topics will pop up.  You can click
any topic to jump to that section.  If you read this in org-mode, the
file will open folded.  It will look like:
#+BEGIN_EXAMPLE
#+TITLE: DON'T PANIC
#+AUTHOR: David Bjergaard
#+EMAIL: david.b@duke.edu
#+OPTIONS:   H:5 num:nil toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+LaTeX_CLASS: article

 * A Hitchhiker's guide to High Energy Physics...
#+END_EXAMPLE
Place your cursor at the beginning of =* A Hitchhiker's...= and hit
=TAB=, this will expand the topics allowing you to see and over-view
of the document.  Move to whichever topic you're interested in and
hit =TAB= again to expand that section.  

If you are reading this in Vim without [[https://github.com/jceb/vim-orgmode][Vim-OrgMode]], then you will
have no folding and the whole document will be expanded.  Jump to
various headlines by searching for "=**=" (two levels deep),
"=***=" (three levels deep), "=****=" (four levels deep), etc.  

If you are reading this as a PDF, there is no Table of Contents. Just
scroll to the section you are interested in.  

*NOTE* If you are reading this on GitHub, a link to another section
will probably be broken due to a bug in how GitHub parses org-flavored
markdown.  

*** Disclaimer
All bottles of donated Old Janx Spirit are redirected to our lawyers,
who are out enjoying them now.  They insisted that we include this
disclaimer:

#+BEGIN_QUOTE
The Hitchhiker's Guide to High Energy Physics is a set of documents
and software herein referred to as "The Guide"

The Guide is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation; either version 3, or (at your option)
any later version.

The Guide is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this software.  If not, see <http://www.gnu.org/licenses/>.
#+END_QUOTE

Also, note that the content of this guide is satirical in nature, and
is intended to be sarcastic. If you have a weak heart or are easily
offended, it may be better to seek out other sources of information.

