docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>DON'T PANIC</title>
<!-- 2017-01-23 Mon 13:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="David Bjergaard" />
</head>
<body>
<div id="content">
<h1 class="title">DON'T PANIC</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">A Hitchhiker's guide to High Energy Physics</a>
<ul>
<li><a href="#sec-1-1">Introduction</a>
<ul>
<li><a href="#sec-1-1-1">Navigating the guide</a></li>
<li><a href="#sec-1-1-2">Disclaimer</a></li>
<li><a href="#sec-1-1-3">Obtaining a copy and supporting material</a></li>
</ul>
</li>
<li><a href="#sec-1-2">For Windows Hitchhikers</a>
<ul>
<li><a href="#sec-1-2-1">Software you will need</a></li>
</ul>
</li>
<li><a href="#sec-1-3">For Linux Hitchhikers</a>
<ul>
<li><a href="#sec-1-3-1">Software you will need</a></li>
<li><a href="#sec-1-3-2">The Terminal</a>
<ul>
<li><a href="#sec-1-3-2-1">Line Editing</a></li>
<li><a href="#sec-1-3-2-2">Managing Jobs</a></li>
</ul>
</li>
<li><a href="#sec-1-3-3">Configuring SSH</a>
<ul>
<li><a href="#sec-1-3-3-1">SSH Keys</a></li>
<li><a href="#sec-1-3-3-2">SSH Agent</a></li>
</ul>
</li>
<li><a href="#sec-1-3-4">Version Control Systems</a></li>
<li><a href="#sec-1-3-5">*rc Files</a></li>
</ul>
</li>
<li><a href="#sec-1-4">For Mac OS X Hitchhikers</a>
<ul>
<li><a href="#sec-1-4-1">Software you will need</a></li>
</ul>
</li>
<li><a href="#sec-1-5">Editors</a>
<ul>
<li><a href="#sec-1-5-1">Finding an editor Guru</a>
<ul>
<li><a href="#sec-1-5-1-1">Editor Guru etiquette</a></li>
<li><a href="#sec-1-5-1-2">Keeping your Guru happy</a></li>
</ul>
</li>
<li><a href="#sec-1-5-2">Emacs</a></li>
<li><a href="#sec-1-5-3">Vim</a></li>
<li><a href="#sec-1-5-4">Others</a></li>
</ul>
</li>
<li><a href="#sec-1-6">Software Design</a></li>
<li><a href="#sec-1-7">A brief introduction to C++</a>
<ul>
<li><a href="#sec-1-7-1">Pointers</a>
<ul>
<li><a href="#sec-1-7-1-1">Why are pointer's useful at all?</a></li>
<li><a href="#sec-1-7-1-2">References</a></li>
</ul>
</li>
<li><a href="#sec-1-7-2">Methods</a></li>
<li><a href="#sec-1-7-3">Classes</a></li>
</ul>
</li>
<li><a href="#sec-1-8">An even briefer introduction to Python</a>
<ul>
<li><a href="#sec-1-8-1">PyROOT: ROOT bindings in python</a></li>
</ul>
</li>
<li><a href="#sec-1-9">ROOT</a>
<ul>
<li><a href="#sec-1-9-1">Installing and setting up</a>
<ul>
<li><a href="#sec-1-9-1-1">On Windows</a></li>
<li><a href="#sec-1-9-1-2">On MacOS</a></li>
<li><a href="#sec-1-9-1-3">On Ubuntu</a></li>
</ul>
</li>
<li><a href="#sec-1-9-2">Building From source</a>
<ul>
<li><a href="#sec-1-9-2-1">Getting the Pre-Requisites</a></li>
<li><a href="#sec-1-9-2-2">May the Source be with you</a></li>
<li><a href="#sec-1-9-2-3">Building</a></li>
<li><a href="#sec-1-9-2-4">Using your new superpower</a></li>
</ul>
</li>
<li><a href="#sec-1-9-3">Advanced Build Options</a></li>
<li><a href="#sec-1-9-4">A Path to ROOT enlightenment</a>
<ul>
<li><a href="#sec-1-9-4-1">Level 1: Macros</a></li>
<li><a href="#sec-1-9-4-2">Level 2: Compiled Macros</a></li>
<li><a href="#sec-1-9-4-3">Level 3: Compiled Programs</a></li>
<li><a href="#sec-1-9-4-4">A note on Enlightenment</a></li>
</ul>
</li>
<li><a href="#sec-1-9-5">PyROOT</a></li>
<li><a href="#sec-1-9-6">Fitting Data with RooFit</a></li>
<li><a href="#sec-1-9-7">Styling Plots</a>
<ul>
<li><a href="#sec-1-9-7-1">Example Style</a></li>
<li><a href="#sec-1-9-7-2">Transparent Plots</a></li>
</ul>
</li>
<li><a href="#sec-1-9-8">Extending ROOT with custom classes</a></li>
<li><a href="#sec-1-9-9">Important Gotcha's</a>
<ul>
<li><a href="#sec-1-9-9-1">TTrees</a>
<ul>
<li><a href="#sec-1-9-9-1-1">Drawing trees</a></li>
<li><a href="#sec-1-9-9-1-2">Caching trees</a></li>
<li><a href="#sec-1-9-9-1-3">Splitting Trees</a></li>
</ul>
</li>
<li><a href="#sec-1-9-9-2">TH1</a></li>
<li><a href="#sec-1-9-9-3">TH2</a>
<ul>
<li><a href="#sec-1-9-9-3-1">Splitting a 2D</a></li>
</ul>
</li>
<li><a href="#sec-1-9-9-4">THStack</a>
<ul>
<li><a href="#sec-1-9-9-4-1">Get Sum of Stack</a></li>
<li><a href="#sec-1-9-9-4-2">A pointer here, a pointer there, who am I?</a></li>
</ul>
</li>
<li><a href="#sec-1-9-9-5">TFile</a>
<ul>
<li><a href="#sec-1-9-9-5-1">Recreate, create, new, update</a></li>
</ul>
</li>
<li><a href="#sec-1-9-9-6">Extracting ACLiCs compilation steps</a></li>
</ul>
</li>
<li><a href="#sec-1-9-10">Debugging with ROOT</a>
<ul>
<li><a href="#sec-1-9-10-1">A "crash" course on reading a stack trace</a></li>
<li><a href="#sec-1-9-10-2">Using gdb</a></li>
<li><a href="#sec-1-9-10-3">Valgrind</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-10">Physics</a>
<ul>
<li><a href="#sec-1-10-1">Study Guide For Griffiths</a></li>
<li><a href="#sec-1-10-2">Coordinate Systems used in HEP</a></li>
<li><a href="#sec-1-10-3">Monte Carlo Event Weights</a></li>
<li><a href="#sec-1-10-4">Drawing Feynman Diagrams Digitally</a></li>
<li><a href="#sec-1-10-5">What to do if you've lost a 2&pi;</a></li>
</ul>
</li>
<li><a href="#sec-1-11">Responsible Research</a>
<ul>
<li><a href="#sec-1-11-1">Lab Notebooks</a>
<ul>
<li><a href="#sec-1-11-1-1">Pen/Paper Notebook</a></li>
<li><a href="#sec-1-11-1-2">Org-mode Notebook</a></li>
<li><a href="#sec-1-11-1-3">Flat text file</a></li>
<li><a href="#sec-1-11-1-4">Wiki/ELog</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-12">Getting Help</a></li>
<li><a href="#sec-1-13">FAQ</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">A Hitchhiker's guide to High Energy Physics</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Introduction</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Welcome to High Energy Physics.  Like the Galaxy, HEP is a wonderful
and mysterious place filled with amazing things.  The intent of this
guide is to provide a jump-start to HEP research.  Its purpose is to
be entertaining and uninformative.  The information in this guide was
hard won, The Editor does not intend it to be different for our dear
reader.  This guide is not intended to make the reader's life easier.
It is not intended to teach anything.  It is intended to provide the
dear reader with a glossary of concepts for further research.
</p>

<p>
If the reader finds this guide entertaining, but uninformative, then
please send a bottle of Old Janx Spirit to The Editor. The Guide is
not intended to be read linearly.  Jump to the section in need, and if
that section contains links to other sections, then please see above
regarding edits. Prepare to be frustrated.
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">Navigating the guide</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
A note on key notation: Keys sequences follow the "emacs" style for
notating keys.  Therefore "<code>C-c</code>" means hold down the control key,
while pressing the <code>c</code> key. "<code>M-a</code>" would mean hold down the "Meta" key
and press the <code>a</code> key.  On most keyboards the Meta key is the key
labeled "Alt".  There is also the "Super" key, on most PC keyboards
this key has the "Windows icon" on it.  The function keys 1-12 are
notated as <code>F1</code> etc.  The escape key is usually notated <code>ESC</code>, and
the enter key is notated <code>RET</code> for Return.  A sequence is denoted by
a series of keys and spaces or dashes.  A dash means hold the two
keys at the same time, a space means release the previous keys and
continue with the next instruction.  Some examples:
</p>
<ul class="org-ul">
<li>"<code>C-c C-a</code>" Control-C release Control-A
</li>
<li>"<code>C-c a</code>" Control-c release A
</li>
<li>"<code>C-M-f</code>" Press Control, then Meta, then F without releasing
</li>
</ul>

<p>
The online version of the guide includes a Table of Contents; simply
mouse over it and a full list of topics will pop up.  You can click
any topic to jump to that section.  If you read this in org-mode, the
file will open folded.  It will look like:
</p>
<pre class="example">
#+TITLE: DON'T PANIC
#+AUTHOR: David Bjergaard
#+EMAIL: david.b@duke.edu
#+OPTIONS:   H:5 num:nil toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t &lt;:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+LaTeX_CLASS: article

 * A Hitchhiker's guide to High Energy Physics...
</pre>
<p>
Place your cursor at the beginning of <code>* A Hitchhiker's...</code> and hit
<code>TAB</code>, this will expand the topics allowing you to see and over-view
of the document.  Move to whichever topic you're interested in and
hit <code>TAB</code> again to expand that section.  
</p>

<p>
If you are reading this in Vim without <a href="https://github.com/jceb/vim-orgmode">Vim-OrgMode</a>, then you will
have no folding and the whole document will be expanded.  Jump to
various headlines by searching for "<code>**</code>" (two levels deep),
"<code>***</code>" (three levels deep), "<code>****</code>" (four levels deep), etc.  
</p>

<p>
If you are reading this as a PDF, there is no Table of Contents. Just
scroll to the section you are interested in.  
</p>

<p>
<b>NOTE</b> If you are reading this on GitHub, a link to another section
will probably be broken due to a bug in how GitHub parses org-flavored
markdown.  
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">Disclaimer</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
All bottles of donated Old Janx Spirit are redirected to our lawyers,
who are out enjoying them now.  They insisted that we include this
disclaimer:
</p>

<blockquote>
<p>
The Hitchhiker's Guide to High Energy Physics is a set of documents
and software herein referred to as "The Guide"
</p>

<p>
The Guide is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation; either version 3, or (at your option)
any later version.
</p>

<p>
The Guide is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.
</p>

<p>
You should have received a copy of the GNU General Public License
along with this software.  If not, see <a href="http://www.gnu.org/licenses/">http://www.gnu.org/licenses/</a>.
</p>
</blockquote>

<p>
Also, note that the content of this guide is satirical in nature, and
is intended to be sarcastic. If you have a weak heart or are easily
offended, it may be better to seek out other sources of information.
</p>
</div>
</div>
