index.org
*** Obtaining a copy and supporting material
All of the sources for the guide are hosted on GitHub. 

Here are some quick-links:
- [[http://www.phy.duke.edu/~dmb60/the-guide/][The Guide]] the online version of the guide
- [[./the-guide.pdf][PDF of The Guide]] if you prefer that sort of thing, though it's of
  limited use in printed form.
- [[http://www.phy.duke.edu/~dmb60/the-guide/the-guide.org][Org source]] of the online version
- [[https://github.com/dbjergaard/hitchhikers-guide-to-hep][GitHub Repo]] where source code is hosted
- [[https://github.com/dbjergaard/hitchhikers-guide-to-hep/tree/master/compiled-macros][Compiled Macros]] for Level 2 of ROOT enlightenment
- [[https://github.com/dbjergaard/hitchhikers-guide-to-hep/tree/master/compiled-program][Compiled Programs]] for Level 3 of ROOT enlightenment
- [[https://github.com/dbjergaard/hitchhikers-guide-to-hep/issues][Bug Reports/Feature Requests]]
- [[https://github.com/dbjergaard/hitchhikers-guide-to-hep/pulls][Pull Requests]] for submitting patches

To get a local copy:
#+BEGIN_SRC sh
git clone https://github.com/dbjergaard/hitchhikers-guide-to-hep.git
#+END_SRC
Then you'll have a copy of the org file, as well as the compiled
macros and compiled programs.  

** For Windows Hitchhikers
Everyone should read [[*For%20Linux%20Hitchhikers][For Linux Hitchhikers]] to understand what
functionality they'll need (especially when working with or on remote
machines)

While it is possible to practice HEP from the comfort of Bill Gates'
brain child, it is not recommended by The Editor.  (He doesn't
run Windows anyway, daylight scares him.) If you insist on using
Windows, the following is a list of useful software.
*** Software you will need
- [[*For%20Linux%20Hitchhikers][For Linux Hitchhikers]]
- [[http://www.chiark.greenend.org.uk/~sgtatham/putty/download.html][PuTTY (ssh client for Windows)]]: Secure SHell is the standard way of
  accessing *nix machines remotely.  PuTTY is the Windows client for
  this. 
- [[*On%20Windows][ROOT]]: The industry standard for High Energy Physics analysis.
   Beware: this program uses an [[https://en.wikipedia.org/wiki/Technology_in_The_Hitchhiker's_Guide_to_the_Galaxy#Infinite_Improbability_Drive][Infinite Improbability Drive]] to
   perform analysis.  
- [[http://www.straightrunning.com/XmingNotes/][Xming an X11 server for Windows]]: This allows you to tunnel X11
  applications (ROOT's histogram interface) to your Windows desktop,
  this way your data (and ROOT) can live on a remote machine, but you
  can still interact with them as if they were on your desktop.  (You
  need a *fast* internet connection to do this). Xming comes in two
  flavors: the "web" version, which is locked behind a paywall for
  people who donate to the project, and a slightly less up-to-date
  public version available for free.  Choose the public version. See
  [[http://www.straightrunning.com/XmingNotes/#sect-143][Getting Started]] and [[http://www.straightrunning.com/XmingNotes/trouble.php#head-11][Trouble shooting]] for tips on getting set up.
- [[https://github.com/bmatzelle/gow/wiki][Gow]]: A lightweight Cygwin alternative, this is probably for more
  adventurous hitchhikers only. 
- [[http://cygwin.com/][Cygwin]]: Adds a substrate of the GNU system to Windows (in addition
  to an [[http://x.cygwin.com/][X11 server]]), you can use this to create a more Unix-like
  environment to work from. 
- [[https://www.virtualbox.org/][VirtualBox]]: Allows you to boot operating systems within operating
  systems (useful if you don't want to dual boot Ubuntu) see
  [[*For%20Linux%20Hitchhikers][For Linux Hitchhikers]] after you've setup a working distro.

[[http://www.calebmadrigal.com/running-ubuntu-virtualbox/][See here]] for a nice picture-book tutorial on installing Ubuntu
through VirtualBox on Windows.
** For Linux Hitchhikers
*** Software you will need
 - [[https://www.gnu.org/software/screen/][Screen]]: This lets you pick up where you left off if your ssh
   connection drops, [[http://www.ibm.com/developerworks/aix/library/au-gnu_screen/][here]] is a good conceptual introduction.  If you
   use =screen= on =lxplus=, you'll have to re-initialize your
   kerberos tokens after logging in with =kinit -5=, otherwise you
   won't have read access to your files.
 - [[*On%20Ubuntu][ROOT]]: The industry standard for High Energy Physics analysis.
   Beware: this program uses an [[https://en.wikipedia.org/wiki/Technology_in_The_Hitchhiker's_Guide_to_the_Galaxy#Infinite_Improbability_Drive][Infinite Improbability Drive]] to
   perform analysis.  
 - [[https://help.ubuntu.com/community/Beginners/BashScripting][BASH]]: The command shell of choice for ATLAS Physicists.  You may
   think you could use ZSH, but it's better just to stick with
   what everyone else uses.  CMS Physicists prefer TCSH for some
   weird reason.
 - [[*Editors][Editor]]: Choose you're religion wisely, it will eventually permeate
   your being and change the way you approach life in general.
*** The Terminal
You will, regardless of which operating system you use, be typing
commands into a terminal.  It's inevitable, powerful, and intimidating
to new users.  HEP hitchhikers should feel at home.  Proficiency with
the command line is essential to being a functioning HEP researcher.

The terminal is like the Galaxy Hitchhiker's [[https://en.wikipedia.org/wiki/Technology_in_The_Hitchhiker%2527s_Guide_to_the_Galaxy#Towels][utility towel]]. Every
hitchhiker needs a terminal, and each hitchhiker customizes his or
her towel to their needs.  

If you've never touched a terminal before, and don't know what the
command line is, there are two options:
1. The [[http://lab.demog.berkeley.edu/Docs/12important/12important.pdf][great pedagogical introduction ]] (12 page PDF) by Carl Mason
2. "[[http://www.oliverelliott.org/article/computing/tut_unix/][An Introduction to Unix]]" (a comprehensive, modern take on the unix
   ecosystem) by Oliver Elliott

You should read both, Carl Mason's tutorial should be read
"cover-to-cover", where as Oliver's is written very much in the spirit
of this guide, so bookmark it and refer to it after you've read Carl
Mason's tutorial.
**** Line Editing
Most modern operating systems' default shell is bash.  Be aware that
bash's line editor is set up to respect emacs keybindings, this means
"C-a" is beginning of line "C-e" the end, etc. You can change to vi
bindings by typing:
#+BEGIN_SRC sh
set -o vi
#+END_SRC
If you forget which mode your in, check it by typing:
#+BEGIN_SRC sh
set -o
#+END_SRC
If you want these changes to be permanent, add them to your =.bashrc=.
If these commands give you an error, type:
#+BEGIN_SRC sh
echo $SHELL
#+END_SRC
And see what it says (=/bin/bash= if it's bash, may be =/bin/zsh= or
=/bin/tcsh=). If it is not bash, then you need to google information
for the line editor of whichever shell you are using.  
