docs/index.html

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">Obtaining a copy and supporting material</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
All of the sources for the guide are hosted on GitHub. 
</p>

<p>
Here are some quick-links:
</p>
<ul class="org-ul">
<li><a href="http://www.phy.duke.edu/~dmb60/the-guide/">The Guide</a> the online version of the guide
</li>
<li><a href="./the-guide.pdf">PDF of The Guide</a> if you prefer that sort of thing, though it's of
limited use in printed form.
</li>
<li><a href="http://www.phy.duke.edu/~dmb60/the-guide/the-guide.org">Org source</a> of the online version
</li>
<li><a href="https://github.com/dbjergaard/hitchhikers-guide-to-hep">GitHub Repo</a> where source code is hosted
</li>
<li><a href="https://github.com/dbjergaard/hitchhikers-guide-to-hep/tree/master/compiled-macros">Compiled Macros</a> for Level 2 of ROOT enlightenment
</li>
<li><a href="https://github.com/dbjergaard/hitchhikers-guide-to-hep/tree/master/compiled-program">Compiled Programs</a> for Level 3 of ROOT enlightenment
</li>
<li><a href="https://github.com/dbjergaard/hitchhikers-guide-to-hep/issues">Bug Reports/Feature Requests</a>
</li>
<li><a href="https://github.com/dbjergaard/hitchhikers-guide-to-hep/pulls">Pull Requests</a> for submitting patches
</li>
</ul>

<p>
To get a local copy:
</p>
<div class="org-src-container">

<pre class="src src-sh">git clone https://github.com/dbjergaard/hitchhikers-guide-to-hep.git
</pre>
</div>
<p>
Then you'll have a copy of the org file, as well as the compiled
macros and compiled programs.  
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">For Windows Hitchhikers</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Everyone should read <a href="#sec-1-3">For Linux Hitchhikers</a> to understand what
functionality they'll need (especially when working with or on remote
machines)
</p>

<p>
While it is possible to practice HEP from the comfort of Bill Gates'
brain child, it is not recommended by The Editor.  (He doesn't
run Windows anyway, daylight scares him.) If you insist on using
Windows, the following is a list of useful software.
</p>
</div>
<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Software you will need</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li><a href="#sec-1-3">For Linux Hitchhikers</a>
</li>
<li><a href="http://www.chiark.greenend.org.uk/~sgtatham/putty/download.html">PuTTY (ssh client for Windows)</a>: Secure SHell is the standard way of
accessing *nix machines remotely.  PuTTY is the Windows client for
this. 
</li>
<li><i>ROOT</i>: The industry standard for High Energy Physics analysis.
Beware: this program uses an <a href="https://en.wikipedia.org/wiki/Technology_in_The_Hitchhiker's_Guide_to_the_Galaxy#Infinite_Improbability_Drive">Infinite Improbability Drive</a> to
perform analysis.  
</li>
<li><a href="http://www.straightrunning.com/XmingNotes/">Xming an X11 server for Windows</a>: This allows you to tunnel X11
applications (ROOT's histogram interface) to your Windows desktop,
this way your data (and ROOT) can live on a remote machine, but you
can still interact with them as if they were on your desktop.  (You
need a <b>fast</b> internet connection to do this). Xming comes in two
flavors: the "web" version, which is locked behind a paywall for
people who donate to the project, and a slightly less up-to-date
public version available for free.  Choose the public version. See
<a href="http://www.straightrunning.com/XmingNotes/#sect-143">Getting Started</a> and <a href="http://www.straightrunning.com/XmingNotes/trouble.php#head-11">Trouble shooting</a> for tips on getting set up.
</li>
<li><a href="https://github.com/bmatzelle/gow/wiki">Gow</a>: A lightweight Cygwin alternative, this is probably for more
adventurous hitchhikers only. 
</li>
<li><a href="http://cygwin.com/">Cygwin</a>: Adds a substrate of the GNU system to Windows (in addition
to an <a href="http://x.cygwin.com/">X11 server</a>), you can use this to create a more Unix-like
environment to work from. 
</li>
<li><a href="https://www.virtualbox.org/">VirtualBox</a>: Allows you to boot operating systems within operating
systems (useful if you don't want to dual boot Ubuntu) see <a href="#sec-1-3">For Linux Hitchhikers</a> after you've setup a working distro.
</li>
</ul>

<p>
<a href="http://www.calebmadrigal.com/running-ubuntu-virtualbox/">See here</a> for a nice picture-book tutorial on installing Ubuntu
through VirtualBox on Windows.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">For Linux Hitchhikers</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">Software you will need</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/screen/">Screen</a>: This lets you pick up where you left off if your ssh
connection drops, <a href="http://www.ibm.com/developerworks/aix/library/au-gnu_screen/">here</a> is a good conceptual introduction.  If you
use <code>screen</code> on <code>lxplus</code>, you'll have to re-initialize your
kerberos tokens after logging in with <code>kinit -5</code>, otherwise you
won't have read access to your files.
</li>
<li><i>ROOT</i>: The industry standard for High Energy Physics analysis.
Beware: this program uses an <a href="https://en.wikipedia.org/wiki/Technology_in_The_Hitchhiker's_Guide_to_the_Galaxy#Infinite_Improbability_Drive">Infinite Improbability Drive</a> to
perform analysis.  
</li>
<li><a href="https://help.ubuntu.com/community/Beginners/BashScripting">BASH</a>: The command shell of choice for ATLAS Physicists.  You may
think you could use ZSH, but it's better just to stick with
what everyone else uses.  CMS Physicists prefer TCSH for some
weird reason.
</li>
<li><a href="#sec-1-5">Editor</a>: Choose you're religion wisely, it will eventually permeate
your being and change the way you approach life in general.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">The Terminal</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
You will, regardless of which operating system you use, be typing
commands into a terminal.  It's inevitable, powerful, and intimidating
to new users.  HEP hitchhikers should feel at home.  Proficiency with
the command line is essential to being a functioning HEP researcher.
</p>

<p>
The terminal is like the Galaxy Hitchhiker's <a href="https://en.wikipedia.org/wiki/Technology_in_The_Hitchhiker%2527s_Guide_to_the_Galaxy#Towels">utility towel</a>. Every
hitchhiker needs a terminal, and each hitchhiker customizes his or
her towel to their needs.  
</p>

<p>
If you've never touched a terminal before, and don't know what the
command line is, there are two options:
</p>
<ol class="org-ol">
<li>The <a href="http://lab.demog.berkeley.edu/Docs/12important/12important.pdf">great pedagogical introduction </a> (12 page PDF) by Carl Mason
</li>
<li>"<a href="http://www.oliverelliott.org/article/computing/tut_unix/">An Introduction to Unix</a>" (a comprehensive, modern take on the unix
ecosystem) by Oliver Elliott
</li>
</ol>

<p>
You should read both, Carl Mason's tutorial should be read
"cover-to-cover", where as Oliver's is written very much in the spirit
of this guide, so bookmark it and refer to it after you've read Carl
Mason's tutorial.
</p>
</div>
<div id="outline-container-sec-1-3-2-1" class="outline-5">
<h5 id="sec-1-3-2-1">Line Editing</h5>
<div class="outline-text-5" id="text-1-3-2-1">
<p>
Most modern operating systems' default shell is bash.  Be aware that
bash's line editor is set up to respect emacs keybindings, this means
"C-a" is beginning of line "C-e" the end, etc. You can change to vi
bindings by typing:
</p>
<div class="org-src-container">

<pre class="src src-sh">set -o vi
</pre>
</div>
<p>
If you forget which mode your in, check it by typing:
</p>
<div class="org-src-container">

<pre class="src src-sh">set -o
</pre>
</div>
<p>
If you want these changes to be permanent, add them to your <code>.bashrc</code>.
If these commands give you an error, type:
</p>
<div class="org-src-container">

<pre class="src src-sh">echo $SHELL
</pre>
</div>
<p>
And see what it says (<code>/bin/bash</code> if it's bash, may be <code>/bin/zsh</code> or
<code>/bin/tcsh</code>). If it is not bash, then you need to google information
for the line editor of whichever shell you are using.  
</p>
</div>
</div>
