index.org
**** Managing Jobs
Sometimes it will be convenient to spawn a process and continue
working in the current shell.  Usually this is accomplished by
redirecting the stdout and stderr to a file:
#+BEGIN_SRC sh
myLongRunningCommand foo bar baz 42 &> theProcess.log &
#+END_SRC
When you launch the command, you'll see something like:
#+BEGIN_EXAMPLE
[1] 19509
#+END_EXAMPLE
The number =19509= is the PID of the process.  If you have multiple
jobs going they can be summarized by typing =jobs=
#+BEGIN_EXAMPLE
[1]   Running                 myLongRunningCommand foo bar baz 42 &> theProcess.log &
[2]-  Running                 myLongRunningCommand foo bar baz 41 &> theProcess.log &
[3]+  Running                 myLongRunningCommand foo bar baz 40 &> theProcess.log &
#+END_EXAMPLE
Occasionally you'll realize that you don't want the jobs to run
anymore, so to kill them:
#+BEGIN_SRC sh
kill %2
#+END_SRC
where =%1= is the job number you are referencing.  You'll see
something like:
#+BEGIN_EXAMPLE
[2]-  Terminated              myLongRunningCommand foo bar baz 41 &> theProcess.log &
#+END_EXAMPLE

*** Configuring SSH
Many of these tips are [[http://blogs.perl.org/users/smylers/2011/08/ssh-productivity-tips.html][lifted from here]].
Put this in your =~/.ssh/config= file:
#+BEGIN_EXAMPLE
ControlMaster auto
ControlPath /tmp/ssh_mux_%h_%p_%r
ControlPersist yes
ServerAliveInterval 30
ServerAliveCountMax 1
#+END_EXAMPLE
It is possible to setup ssh shorthand to route you to remote
machines. The syntax (in =~/.ssh/config=) is:
#+BEGIN_EXAMPLE
Host shortname
  #expands to shortname.remote.location.edu
  HostName %h.remote.location.edu 
  User username
  ForwardX11 yes #this is equivalient to ssh -Y
  IdentityFile ~/.ssh/id_rsa #path to your pubkey
#+END_EXAMPLE
**** SSH Keys
[[https://help.github.com/articles/generating-ssh-keys][Follow this guide]], stop at step 3.
Now, when you need to start using a new machine:
#+BEGIN_EXAMPLE
ssh-copy-id user@remote.machine.name
#+END_EXAMPLE
Then enter your password.  Now, when you type =ssh
user@remote.machine.name= you will authenticate yourself with your
newly minted RSA key, and you won't have to enter your password.  The
downside is that you'll have to enter your key's passphrase to unlock
it. See below for a way to unlock it once per session.

*NOTE* While it is cryptographically more secure to authenticate
yourself with ssh keys, if your machine is compromised (ie stolen or
hacked) your ssh keys can provide the attacker with easier access to
all the machines you had access to.  This means you should:
1. Use a strong pass *phrase*, not password.  You need to maximize the 
   number of bits of entropy in your key in order to make it
   difficult to crack should the keys fall into enemy hands.  
2. Inform the admins of any machines you had access to if your
   machine is compromised
3. Encrypt your ssh keys (and other sensitive information) in a
   private directory that only you can access
4. *NEVER EVER* store your ssh keys on a third party site (like
   Dropbox or similar services)
**** SSH Agent
If you have ssh-agent running (through the =gnome-keyring= service on
Ubuntu, or directly in your .xinitrc through =ssh-agent blah=) you
can type =ssh-add= when you log in and it will add your ssh key to
the keyring, then you can ssh to any machine that you have copied
your key to without entering the password! 

*NOTE* Once you've added your key to the ssh-agent, anyone can sit
down at your keyboard and log into a remote machine as you! This
means if you step away from your computer (even for a moment) you
should lock the screen or log out.  

*** Version Control Systems
The two major version control systems in HEP are Git and Subversion (svn).  These
are tools and utilities to allow collaboration on large pieces of
software.  

They also provide programmers with a convenient "paper trail" through
the course of developing a piece of software.  It allows them to
revert the source code they are working on to any state that they've
previously checked in.

Subversion is a successor of CVS, everything is stored on a remote
site, and your source code directory contains metadata about the
source code with reference to the remote site.  

Some subversion tutorials:
- [[https://www.clear.rice.edu/comp314/svn.html][Source Control in 10 Minutes ]]
- [[http://www.pointbeing.net/weblog/2009/03/command-line-subversion-tutorial-part-1.html][Command Line Subversion Tutorial (part 1)]]
- [[http://svnbook.red-bean.com/][Version Control with Subversion]] (A comprehensive free book about Subversion)

Git is a software that was written by Linus Torvalds, the hacker
behind Linux.  It was written to manage the Linux kernel, a massive
piece of software.  Git's model for managing source code is slightly
different.  In Git, you maintain the entire repository in your local
copy.  This makes committing, managing, and branching very fast.  It
also means you can work with all of the advantages of a version
control system without internet access.  Simultaneously there is a
copy of the repository on a remote server.  Git handles syncing these
two repositories when instructed.  This can lead to confusion if
you've used other versioning systems, but shouldn't be a problem if
you have no expectations.

Some good Git tutorials:
- type "man gittutorial" in the command line
- [[http://git-scm.com/book][Pro Git]] (an online book, modular and comprehensive in scope)
- [[http://gitimmersion.com/][Git Immersion]]
- [[http://gitolite.com/gcs.html#%25281%2529][Git Concepts Simplified]] (slide show, click to advance)
Intermediate or advanced topics:
- [[http://sethrobertson.github.io/GitFixUm/fixup.html][Undoing, fixing, or removing commits in Git]]
- [[https://blogs.atlassian.com/2014/01/simple-git-workflow-simple/][Simple Git workflow is simple]]
- [[https://ochronus.com/git-tips-from-the-trenches/][Git tips from the trenches]]
