docs/index.html
<div id="outline-container-sec-1-3-2-2" class="outline-5">
<h5 id="sec-1-3-2-2">Managing Jobs</h5>
<div class="outline-text-5" id="text-1-3-2-2">
<p>
Sometimes it will be convenient to spawn a process and continue
working in the current shell.  Usually this is accomplished by
redirecting the stdout and stderr to a file:
</p>
<div class="org-src-container">

<pre class="src src-sh">myLongRunningCommand foo bar baz 42 &amp;&gt; theProcess.log &amp;
</pre>
</div>
<p>
When you launch the command, you'll see something like:
</p>
<pre class="example">
[1] 19509
</pre>
<p>
The number <code>19509</code> is the PID of the process.  If you have multiple
jobs going they can be summarized by typing <code>jobs</code>
</p>
<pre class="example">
[1]   Running                 myLongRunningCommand foo bar baz 42 &amp;&gt; theProcess.log &amp;
[2]-  Running                 myLongRunningCommand foo bar baz 41 &amp;&gt; theProcess.log &amp;
[3]+  Running                 myLongRunningCommand foo bar baz 40 &amp;&gt; theProcess.log &amp;
</pre>
<p>
Occasionally you'll realize that you don't want the jobs to run
anymore, so to kill them:
</p>
<div class="org-src-container">

<pre class="src src-sh">kill %2
</pre>
</div>
<p>
where <code>%1</code> is the job number you are referencing.  You'll see
something like:
</p>
<pre class="example">
[2]-  Terminated              myLongRunningCommand foo bar baz 41 &amp;&gt; theProcess.log &amp;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3">Configuring SSH</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Many of these tips are <a href="http://blogs.perl.org/users/smylers/2011/08/ssh-productivity-tips.html">lifted from here</a>.
Put this in your <code>~/.ssh/config</code> file:
</p>
<pre class="example">
ControlMaster auto
ControlPath /tmp/ssh_mux_%h_%p_%r
ControlPersist yes
ServerAliveInterval 30
ServerAliveCountMax 1
</pre>
<p>
It is possible to setup ssh shorthand to route you to remote
machines. The syntax (in <code>~/.ssh/config</code>) is:
</p>
<pre class="example">
Host shortname
  #expands to shortname.remote.location.edu
  HostName %h.remote.location.edu 
  User username
  ForwardX11 yes #this is equivalient to ssh -Y
  IdentityFile ~/.ssh/id_rsa #path to your pubkey
</pre>
</div>
<div id="outline-container-sec-1-3-3-1" class="outline-5">
<h5 id="sec-1-3-3-1">SSH Keys</h5>
<div class="outline-text-5" id="text-1-3-3-1">
<p>
<a href="https://help.github.com/articles/generating-ssh-keys">Follow this guide</a>, stop at step 3.
Now, when you need to start using a new machine:
</p>
<pre class="example">
ssh-copy-id user@remote.machine.name
</pre>
<p>
Then enter your password.  Now, when you type <code>ssh
user@remote.machine.name</code> you will authenticate yourself with your
newly minted RSA key, and you won't have to enter your password.  The
downside is that you'll have to enter your key's passphrase to unlock
it. See below for a way to unlock it once per session.
</p>

<p>
<b>NOTE</b> While it is cryptographically more secure to authenticate
yourself with ssh keys, if your machine is compromised (ie stolen or
hacked) your ssh keys can provide the attacker with easier access to
all the machines you had access to.  This means you should:
</p>
<ol class="org-ol">
<li>Use a strong pass <b>phrase</b>, not password.  You need to maximize the 
number of bits of entropy in your key in order to make it
difficult to crack should the keys fall into enemy hands.  
</li>
<li>Inform the admins of any machines you had access to if your
machine is compromised
</li>
<li>Encrypt your ssh keys (and other sensitive information) in a
private directory that only you can access
</li>
<li><b>NEVER EVER</b> store your ssh keys on a third party site (like
Dropbox or similar services)
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-3-3-2" class="outline-5">
<h5 id="sec-1-3-3-2">SSH Agent</h5>
<div class="outline-text-5" id="text-1-3-3-2">
<p>
If you have ssh-agent running (through the <code>gnome-keyring</code> service on
Ubuntu, or directly in your .xinitrc through <code>ssh-agent blah</code>) you
can type <code>ssh-add</code> when you log in and it will add your ssh key to
the keyring, then you can ssh to any machine that you have copied
your key to without entering the password! 
</p>

<p>
<b>NOTE</b> Once you've added your key to the ssh-agent, anyone can sit
down at your keyboard and log into a remote machine as you! This
means if you step away from your computer (even for a moment) you
should lock the screen or log out.  
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4">Version Control Systems</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
The two major version control systems in HEP are Git and Subversion (svn).  These
are tools and utilities to allow collaboration on large pieces of
software.  
</p>

<p>
They also provide programmers with a convenient "paper trail" through
the course of developing a piece of software.  It allows them to
revert the source code they are working on to any state that they've
previously checked in.
</p>

<p>
Subversion is a successor of CVS, everything is stored on a remote
site, and your source code directory contains metadata about the
source code with reference to the remote site.  
</p>

<p>
Some subversion tutorials:
</p>
<ul class="org-ul">
<li><a href="https://www.clear.rice.edu/comp314/svn.html">Source Control in 10 Minutes </a>
</li>
<li><a href="http://www.pointbeing.net/weblog/2009/03/command-line-subversion-tutorial-part-1.html">Command Line Subversion Tutorial (part 1)</a>
</li>
<li><a href="http://svnbook.red-bean.com/">Version Control with Subversion</a> (A comprehensive free book about Subversion)
</li>
</ul>

<p>
Git is a software that was written by Linus Torvalds, the hacker
behind Linux.  It was written to manage the Linux kernel, a massive
piece of software.  Git's model for managing source code is slightly
different.  In Git, you maintain the entire repository in your local
copy.  This makes committing, managing, and branching very fast.  It
also means you can work with all of the advantages of a version
control system without internet access.  Simultaneously there is a
copy of the repository on a remote server.  Git handles syncing these
two repositories when instructed.  This can lead to confusion if
you've used other versioning systems, but shouldn't be a problem if
you have no expectations.
</p>

<p>
Some good Git tutorials:
</p>
<ul class="org-ul">
<li>type "man gittutorial" in the command line
</li>
<li><a href="http://git-scm.com/book">Pro Git</a> (an online book, modular and comprehensive in scope)
</li>
<li><a href="http://gitimmersion.com/">Git Immersion</a>
</li>
<li><a href="http://gitolite.com/gcs.html#%25281%2529">Git Concepts Simplified</a> (slide show, click to advance)
</li>
</ul>
<p>
Intermediate or advanced topics:
</p>
<ul class="org-ul">
<li><a href="http://sethrobertson.github.io/GitFixUm/fixup.html">Undoing, fixing, or removing commits in Git</a>
</li>
<li><a href="https://blogs.atlassian.com/2014/01/simple-git-workflow-simple/">Simple Git workflow is simple</a>
</li>
<li><a href="https://ochronus.com/git-tips-from-the-trenches/">Git tips from the trenches</a>
</li>
</ul>
</div>
</div>
