index.org
*** *rc Files
 =*rc= files are special files that are executed every time a program
 starts. They almost exclusively live in the user's home directory,
 and can be shadowed by the system.  Sometimes they have a special
 syntax for setting options, sometimes they are written in a scripting
 language.  The most relevant rc files for a new hitchhiker are:
- .rootrc :: the file that sets root options
- .bashrc :: this is executed every time you open a terminal in bash
- .tcshrc :: as above but for tcsh (hopefully you aren't using this!)
- .zshrc :: as above for the zsh shell
- .vimrc :: configuration options for the venerable vim editor
- .screenrc :: options for gnu screen
- .emacs :: written in emacs lisp, is executed on startup, breaks the
            rc naming scheme.  Advanced emacs users have
            multi-thousand line rc files

There are other files, if you want to know about them you can do:
#+BEGIN_SRC sh
ls .*rc
#+END_SRC
And google the ones that look interesting.  Alternatively you can look
at the system defaults:
#+BEGIN_SRC sh
ls /etc/*rc
#+END_SRC
Sometimes its useful to copy the system file to your home directory
and then edit it there in order to add your customizations.  Some
programs document their options that way.

** For Mac OS X Hitchhikers
Everyone should read [[*For%20Linux%20Hitchhikers][For Linux Hitchhikers]] to understand what
functionality they'll need (especially when working with or on remote
machines).  As a Mac user, you should also read "[[http://www.insectnation.org/blog/it-just-works-or-does-it-the-dark-side-of-macs-in-hep.html][It just works... or
does it? The dark side of Macs in HEP]]" by Andy Buckley.  It explains
in detail issues with software development on a Mac.  It is an opinion
piece, so don't expect it to be balanced. Also, consider asking your
supervisor for an account on a Linux box and *never look back.* 
*** Software you will need
 - [[http://xquartz.macosforge.org/landing/][XQuartz]]: Like XMing for Windows, XQuartz runs a local X11 server
   for tunneling X11 applications over SSH, unlike Windows, you don't
   need a separate SSH program, ssh is built in.
 - [[https://en.wikipedia.org/wiki/Terminal_%2528OS_X%2529][Terminal.app]]: This is Mac OS's default terminal emulator. It comes
   with Mac OS, so you shouldn't need to install it.  You should be
   aware of it though.
 - [[*On%20MacOS][ROOT]]: The industry standard for High Energy Physics analysis.
   Beware: this program uses an [[https://en.wikipedia.org/wiki/Technology_in_The_Hitchhiker's_Guide_to_the_Galaxy#Infinite_Improbability_Drive][Infinite Improbability Drive]] to
   perform analysis.  
 - [[http://aquamacs.org/][Aquamacs]]: A port of Emacs that uses Aqua as a standard OS X
   application. This integrates Emacs with the Mac OS UI.  In the
   long history of corporate acquisitions a lot of Emacs hackers (from
   NeXTSTEP) ended up at apple, you will find that Mac OS integrates
   the Emacs experience much more fundamentally than any other OS in
   existance. (This doesn't mean you need to use Emacs if you use Mac
   OS, just that your muscle memory will thank you subconsciously.)
 - [[https://www.macports.org/install.php][MacPorts]]: A system for compiling and installing open source
   software on the Mac
 - [[http://brew.sh][Home Brew]]: A package manager for Mac OS, allowing you to install
   various utilities that don't necessarily come pre-installed with
   Mac OS. 
** Editors
Like the major world religions, there are also major editors.  In
the *nix ecosystem there are two main editors: Emacs and Vim. There are
others, but they are many, and beyond the scope of this guide.  

The most important thing to do after [[https://mjambon.github.io/vim-vs-emacs/][choosing an editor]] is to work
through its corresponding tutorial ([[https://stackoverflow.com/questions/1430164/differences-between-Emacs-and-vim][more pragmatic advice here]]).  An
oft heard recommendation is that "Emacs is easier to learn than
vi(m)".  A more accurate statement may be that it is easier to make
things happen in Emacs than Vim, but the two editors are in some sense
the yin and yang of text. True enlightenment in either of these
editors takes roughly the same amount of time after completing the
corresponding tutorial.

*** Finding an editor Guru
After you have finished the tutorial for your editor of choice, then
it's time to find a guru.  Guru's are best located by asking around.
If you are talking with someone and notice they use your editor,
don't be afraid to ask them how they did something. Most of the time
the Guru will be flattered and may even volunteer to help you with
any other editor related questions.  
**** Editor Guru etiquette
While it is generally OK to ask your Guru any editor related
question, it is best to keep questions restricted to the editor in
question.  Flame wars have been fought for decades over which is the
"one true editor." 

In order to prevent a /faux pas/, it is best to make sure you know which
editor your guru uses.  This is especially true in the case of a
vi(m) or Emacs guru. 

Another thing to be careful of is repeatedly asking basic questions.
Again, some gurus will tolerate this at the beginning, but after a
point the guru expects you to master the basics (on your own). The
most valuable knowledge your guru can impart is not written in the
tutorial that came with the editor.
**** Keeping your Guru happy
Guru's subsist mainly on a liquid diet of caffeinated beverages
during the day and beer (occasionally wine) at night.  It is
important that your Guru remain well lubricated. It is generally
considered a good gesture to offer your Guru his/her beverage of
choice if you've found him/her to be especially helpful on your path
to enlightenment. 
