docs/index.html
<div id="outline-container-sec-1-3-5" class="outline-4">
<h4 id="sec-1-3-5">*rc Files</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
<code>*rc</code> files are special files that are executed every time a program
starts. They almost exclusively live in the user's home directory,
and can be shadowed by the system.  Sometimes they have a special
syntax for setting options, sometimes they are written in a scripting
language.  The most relevant rc files for a new hitchhiker are:
</p>
<dl class="org-dl">
<dt> .rootrc </dt><dd>the file that sets root options
</dd>
<dt> .bashrc </dt><dd>this is executed every time you open a terminal in bash
</dd>
<dt> .tcshrc </dt><dd>as above but for tcsh (hopefully you aren't using this!)
</dd>
<dt> .zshrc </dt><dd>as above for the zsh shell
</dd>
<dt> .vimrc </dt><dd>configuration options for the venerable vim editor
</dd>
<dt> .screenrc </dt><dd>options for gnu screen
</dd>
<dt> .emacs </dt><dd>written in emacs lisp, is executed on startup, breaks the
rc naming scheme.  Advanced emacs users have
multi-thousand line rc files
</dd>
</dl>

<p>
There are other files, if you want to know about them you can do:
</p>
<div class="org-src-container">

<pre class="src src-sh">ls .*rc
</pre>
</div>
<p>
And google the ones that look interesting.  Alternatively you can look
at the system defaults:
</p>
<div class="org-src-container">

<pre class="src src-sh">ls /etc/*rc
</pre>
</div>
<p>
Sometimes its useful to copy the system file to your home directory
and then edit it there in order to add your customizations.  Some
programs document their options that way.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">For Mac OS X Hitchhikers</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Everyone should read <a href="#sec-1-3">For Linux Hitchhikers</a>
 to understand what
functionality they'll need (especially when working with or on remote
machines).  As a Mac user, you should also read "<a href="http://www.insectnation.org/blog/it-just-works-or-does-it-the-dark-side-of-macs-in-hep.html">It just works&#x2026; or
does it? The dark side of Macs in HEP</a>" by Andy Buckley.  It explains
in detail issues with software development on a Mac.  It is an opinion
piece, so don't expect it to be balanced. Also, consider asking your
supervisor for an account on a Linux box and <b>never look back.</b> 
</p>
</div>
<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">Software you will need</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li><a href="http://xquartz.macosforge.org/landing/">XQuartz</a>: Like XMing for Windows, XQuartz runs a local X11 server
for tunneling X11 applications over SSH, unlike Windows, you don't
need a separate SSH program, ssh is built in.
</li>
<li><a href="https://en.wikipedia.org/wiki/Terminal_%2528OS_X%2529">Terminal.app</a>: This is Mac OS's default terminal emulator. It comes
with Mac OS, so you shouldn't need to install it.  You should be
aware of it though.
</li>
<li><i>ROOT</i>: The industry standard for High Energy Physics analysis.
Beware: this program uses an <a href="https://en.wikipedia.org/wiki/Technology_in_The_Hitchhiker's_Guide_to_the_Galaxy#Infinite_Improbability_Drive">Infinite Improbability Drive</a> to
perform analysis.  
</li>
<li><a href="http://aquamacs.org/">Aquamacs</a>: A port of Emacs that uses Aqua as a standard OS X
application. This integrates Emacs with the Mac OS UI.  In the
long history of corporate acquisitions a lot of Emacs hackers (from
NeXTSTEP) ended up at apple, you will find that Mac OS integrates
the Emacs experience much more fundamentally than any other OS in
existance. (This doesn't mean you need to use Emacs if you use Mac
OS, just that your muscle memory will thank you subconsciously.)
</li>
<li><a href="https://www.macports.org/install.php">MacPorts</a>: A system for compiling and installing open source
software on the Mac
</li>
<li><a href="http://brew.sh">Home Brew</a>: A package manager for Mac OS, allowing you to install
various utilities that don't necessarily come pre-installed with
Mac OS. 
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Editors</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Like the major world religions, there are also major editors.  In
the *nix ecosystem there are two main editors: Emacs and Vim. There are
others, but they are many, and beyond the scope of this guide.  
</p>

<p>
The most important thing to do after <a href="https://mjambon.github.io/vim-vs-emacs/">choosing an editor</a> is to work
through its corresponding tutorial (<a href="https://stackoverflow.com/questions/1430164/differences-between-Emacs-and-vim">more pragmatic advice here</a>).  An
oft heard recommendation is that "Emacs is easier to learn than
vi(m)".  A more accurate statement may be that it is easier to make
things happen in Emacs than Vim, but the two editors are in some sense
the yin and yang of text. True enlightenment in either of these
editors takes roughly the same amount of time after completing the
corresponding tutorial.
</p>
</div>

<div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1">Finding an editor Guru</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
After you have finished the tutorial for your editor of choice, then
it's time to find a guru.  Guru's are best located by asking around.
If you are talking with someone and notice they use your editor,
don't be afraid to ask them how they did something. Most of the time
the Guru will be flattered and may even volunteer to help you with
any other editor related questions.  
</p>
</div>
<div id="outline-container-sec-1-5-1-1" class="outline-5">
<h5 id="sec-1-5-1-1">Editor Guru etiquette</h5>
<div class="outline-text-5" id="text-1-5-1-1">
<p>
While it is generally OK to ask your Guru any editor related
question, it is best to keep questions restricted to the editor in
question.  Flame wars have been fought for decades over which is the
"one true editor." 
</p>

<p>
In order to prevent a <i>faux pas</i>, it is best to make sure you know which
editor your guru uses.  This is especially true in the case of a
vi(m) or Emacs guru. 
</p>

<p>
Another thing to be careful of is repeatedly asking basic questions.
Again, some gurus will tolerate this at the beginning, but after a
point the guru expects you to master the basics (on your own). The
most valuable knowledge your guru can impart is not written in the
tutorial that came with the editor.
</p>
</div>
</div>
<div id="outline-container-sec-1-5-1-2" class="outline-5">
<h5 id="sec-1-5-1-2">Keeping your Guru happy</h5>
<div class="outline-text-5" id="text-1-5-1-2">
<p>
Guru's subsist mainly on a liquid diet of caffeinated beverages
during the day and beer (occasionally wine) at night.  It is
important that your Guru remain well lubricated. It is generally
considered a good gesture to offer your Guru his/her beverage of
choice if you've found him/her to be especially helpful on your path
to enlightenment. 
</p>
</div>
</div>
</div>
