index.org
*** Emacs
The end goal of any student of the [[http://www.jwz.org/hacks/why-cooperation-with-rms-is-impossible.mp3][Church of Emacs]] is to obtain
proficiency reprogramming the editor to solve the task at hand.  This
is ultimately stems from the philosophy of lisp (this gift was given
to us by [[http://www.stallman.org/saint.html][St. IGNUcious]] an AI hacker from MIT where Emacs was born).
In lisp, the flexibility of the language allows it to be re-written to
solve the problem as clearly as possible.  In Emacs, an enlightened
user will write a substrate of elisp (Emacs' dialect of lisp) in order
to solve the editing problem at hand.

While customizing and writing your .emacs (the initialization file
loaded by Emacs in your home directory) is a spiritual journey, there
are those who have done their best to illuminate the path. [[http://www.dialectical-computing.de/blog/blog/2014/03/02/a-simple-emacs-configuration/][A brief
guide to customization philosophies here]].

The Editor finds the following packages essential:
- [[info:tramp#Top][tramp]]: If your reading this in Emacs, you can follow the link with
  "C-c C-o". It is *the* most important aspect of Emacs for HEP
  users. It allows you to "visit" files on remote machines from the
  Emacs running on your desktop.  It does this through ssh.  To visit
  a remote file, type "C-x C-f" and then type
  '/ssh:user@remote.host:~/remote/path', note that tab completion
  works remotely just the same as visiting a file locally! Tramp is
  also aware of ssh aliases in =~/.ssh/config=, see [[*Configuring SSH]].
- [[info:calc#Top][Calc]] - ""Calc" is an advanced desk calculator and mathematical tool
  written by Dave Gillespie that runs as part of the GNU Emacs
  environment." It handles barns and electron volts out of the box!
- [[http://www.emacswiki.org/emacs/FillAdapt][filladapt]]: a mode for more intelligently filling text in paragraphs
- [[http://www.emacswiki.org/emacs/FlySpell][flyspell]]: a spell checker that highlights mispelled words (will check
  in comments if in a programming mode)
- [[http://www.emacswiki.org/cgi-bin/wiki/RectangleMark][rect-mark]]: Adds facilities for marking yanking and otherwise
  editing columnar formatted text. 
- [[info:emacs#Dired][dired]] (another info link): a directory editor for manipulating files
  in the Emacs way
- [[http://ethanschoonover.com/solarized][solarized-theme]]: A theme by Ethan Schoonover, comes in dark and
  light variants that actually complement each other well, another
  good one is zenburn 
- [[http://www.emacswiki.org/emacs/IbufferMode][ibuffer]]: changes the buffer interface and allows you to group
  buffers based on various buffer attributes
- [[http://www.emacswiki.org/emacs/ParEdit][paredit]]: Enhances Emacs's awareness of parenthetic structure 
- [[https://github.com/Fuco1/smartparens][smartparens]]: Electrically pairs and deletes delimeters when
  appropriate (never miss a closing brace again!)
- [[http://www.emacswiki.org/emacs/AutoComplete][auto-complete]]: When setup properly, tab completes anything at any
  point depending on past input or names in other buffers.
- [[http://www.emacswiki.org/emacs/AUCTeX][auctex]]: LaTeX editing facilities (for when org-mode doesn't quite cut
  it)
- [[http://orgmode.org/][org-mode]]: This guide is written in org-mode. Org-mode can manage
  [[http://orgmode.org/worg/org-tutorials/orgtutorial_dto.html][todo lists]], [[http://orgmode.org/worg/org-web.html][write websites]], serve as a [[https://github.com/dbjergaard/research-log][lab notebook]], execute code
  for [[http://orgmode.org/worg/org-contrib/babel/][literate programming]] and many other things.  More relevant for
  physicists is the [[http://home.fnal.gov/~neilsen/notebook/orgExamples/org-examples.html][org-mode cookbook]]. People switch to Emacs just to
  get org-mode!

Init files of famous Emacs hackers are (in no order of awesomeness)
[[https://github.com/magnars/.emacs.d][Magnar Sveen]], [[https://github.com/technomancy/dotfiles/tree/master/.emacs.d][Technomancy]], [[https://github.com/jwiegley/dot-emacs][John Wiegley]].  There are also software
packages that intend to comprehensively change the Emacs out of the
box to a better user experience.  The two most famous are [[https://github.com/bbatsov/prelude][Prelude]] and
[[https://github.com/overtone/emacs-live][Emacs Live]]. An example (slightly annotated) init file can be found [[https://github.com/dbjergaard/dotfiles/blob/master/emacs-lisp/init.org][here]].

Finally, there are some Emacs gurus who post blogs on the internet.
Some particularly useful ones are [[http://emacsredux.com/][Emacs Redux]],
[[http://www.masteringemacs.org/][Mastering Emacs]], and [[http://emacs-fu.blogspot.com/][Emacs Fu]].

Various religious texts granting Emacs users various powers (such as
reading [[http://www.emacswiki.org/emacs/CategoryMail][email]], [[http://www.emacswiki.org/emacs/CategoryChatClient][chatting]], [[http://www.emacswiki.org/emacs/Twitter][tweeting]], [[http://www.emacswiki.org/emacs/CategoryGames][playing games]], [[http://www.emacswiki.org/emacs/MusicPlayers][listening to music]])
can be found at the [[http://www.emacswiki.org/emacs/][Emacs Wiki]]. 

*** Vim
If Emacs is like Catholicism, then Vim is like Buddhism.  Vim is the
modern incarnation of vi, a modal text editor that descended from ed.
The modal way of editing is by expressing in a few keystrokes how the
text should be manipulated.  This is in contrast to Emacs, where text
is manipulated directly.  This fundamental difference is the source of
much confusion for new users, and is also why many people recommend
Emacs as "being easier to learn." This should not deter new users from
learning vi(m), as its editing facilities are substantial.

A functional =.vimrc= looks like:
#+BEGIN_EXAMPLE
syntax on
set cursorline
set hlsearch
set ic
set incsearch
set ruler
set shiftwidth=4
set tabstop=4
set wrap
#+END_EXAMPLE

To learn Vim, type =vimtutor= at the command lime and follow the
instructions. Take your time, and repeat the tutorial once or twice
over a few days.  In the mean time editors such as =gedit= or =nano=
offer a more traditional experience.  As your Vim skills improve, you
will feel more comfortable with Vim and can stop using the less
powerful editors.  

Some useful links include:
- [[http://derekwyatt.org/vim/tutorials/][Vim Videos]] Tutorial videos by Derek Wyatt, the novice videos are
  must see if you are new to vi(m)
- [[http://www.vimgenius.com/][Vim Genius]] a drill website for learning Vim commands
- [[https://www.liquidweb.com/kb/overview-of-vim-text-editor/][New user Vim Tutorial]]
- [[http://blog.sanctum.geek.nz/vim-koans/][Vim Koans]] tidbits of wisdom to ponder
- [[http://www.vim.org/scripts/][A collection of extensions and plugins for Vim]]
- [[http://val.markovic.io/blog/youcompleteme-a-fast-as-you-type-fuzzy-search-code-completion-engine-for-vim][YouCompleteMe]] A Vim autocompletion engine for editing. 
