docs/index.html
<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2">Emacs</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
The end goal of any student of the <a href="http://www.jwz.org/hacks/why-cooperation-with-rms-is-impossible.mp3">Church of Emacs</a> is to obtain
proficiency reprogramming the editor to solve the task at hand.  This
is ultimately stems from the philosophy of lisp (this gift was given
to us by <a href="http://www.stallman.org/saint.html">St. IGNUcious</a> an AI hacker from MIT where Emacs was born).
In lisp, the flexibility of the language allows it to be re-written to
solve the problem as clearly as possible.  In Emacs, an enlightened
user will write a substrate of elisp (Emacs' dialect of lisp) in order
to solve the editing problem at hand.
</p>

<p>
While customizing and writing your .emacs (the initialization file
loaded by Emacs in your home directory) is a spiritual journey, there
are those who have done their best to illuminate the path. <a href="http://www.dialectical-computing.de/blog/blog/2014/03/02/a-simple-emacs-configuration/">A brief
guide to customization philosophies here</a>.
</p>

<p>
The Editor finds the following packages essential:
</p>
<ul class="org-ul">
<li><a href="tramp#Top">tramp</a>: If your reading this in Emacs, you can follow the link with
"C-c C-o". It is <b>the</b> most important aspect of Emacs for HEP
users. It allows you to "visit" files on remote machines from the
Emacs running on your desktop.  It does this through ssh.  To visit
a remote file, type "C-x C-f" and then type
'/ssh:user@remote.host:~/remote/path', note that tab completion
works remotely just the same as visiting a file locally! Tramp is
also aware of ssh aliases in <code>~/.ssh/config</code>, see <a href="#sec-1-3-3">Configuring SSH</a>.
</li>
<li><a href="calc#Top">Calc</a> - ""Calc" is an advanced desk calculator and mathematical tool
written by Dave Gillespie that runs as part of the GNU Emacs
environment." It handles barns and electron volts out of the box!
</li>
<li><a href="http://www.emacswiki.org/emacs/FillAdapt">filladapt</a>: a mode for more intelligently filling text in paragraphs
</li>
<li><a href="http://www.emacswiki.org/emacs/FlySpell">flyspell</a>: a spell checker that highlights mispelled words (will check
in comments if in a programming mode)
</li>
<li><a href="http://www.emacswiki.org/cgi-bin/wiki/RectangleMark">rect-mark</a>: Adds facilities for marking yanking and otherwise
editing columnar formatted text. 
</li>
<li><a href="emacs#Dired">dired</a> (another info link): a directory editor for manipulating files
in the Emacs way
</li>
<li><a href="http://ethanschoonover.com/solarized">solarized-theme</a>: A theme by Ethan Schoonover, comes in dark and
light variants that actually complement each other well, another
good one is zenburn 
</li>
<li><a href="http://www.emacswiki.org/emacs/IbufferMode">ibuffer</a>: changes the buffer interface and allows you to group
buffers based on various buffer attributes
</li>
<li><a href="http://www.emacswiki.org/emacs/ParEdit">paredit</a>: Enhances Emacs's awareness of parenthetic structure 
</li>
<li><a href="https://github.com/Fuco1/smartparens">smartparens</a>: Electrically pairs and deletes delimeters when
appropriate (never miss a closing brace again!)
</li>
<li><a href="http://www.emacswiki.org/emacs/AutoComplete">auto-complete</a>: When setup properly, tab completes anything at any
point depending on past input or names in other buffers.
</li>
<li><a href="http://www.emacswiki.org/emacs/AUCTeX">auctex</a>: LaTeX editing facilities (for when org-mode doesn't quite cut
it)
</li>
<li><a href="http://orgmode.org/">org-mode</a>: This guide is written in org-mode. Org-mode can manage
<a href="http://orgmode.org/worg/org-tutorials/orgtutorial_dto.html">todo lists</a>, <a href="http://orgmode.org/worg/org-web.html">write websites</a>, serve as a <a href="https://github.com/dbjergaard/research-log">lab notebook</a>, execute code
for <a href="http://orgmode.org/worg/org-contrib/babel/">literate programming</a> and many other things.  More relevant for
physicists is the <a href="http://home.fnal.gov/~neilsen/notebook/orgExamples/org-examples.html">org-mode cookbook</a>. People switch to Emacs just to
get org-mode!
</li>
</ul>

<p>
Init files of famous Emacs hackers are (in no order of awesomeness)
<a href="https://github.com/magnars/.emacs.d">Magnar Sveen</a>, <a href="https://github.com/technomancy/dotfiles/tree/master/.emacs.d">Technomancy</a>, <a href="https://github.com/jwiegley/dot-emacs">John Wiegley</a>.  There are also software
packages that intend to comprehensively change the Emacs out of the
box to a better user experience.  The two most famous are <a href="https://github.com/bbatsov/prelude">Prelude</a> and
<a href="https://github.com/overtone/emacs-live">Emacs Live</a>. An example (slightly annotated) init file can be found <a href="https://github.com/dbjergaard/dotfiles/blob/master/emacs-lisp/init.org">here</a>.
</p>

<p>
Finally, there are some Emacs gurus who post blogs on the internet.
Some particularly useful ones are <a href="http://emacsredux.com/">Emacs Redux</a>,
<a href="http://www.masteringemacs.org/">Mastering Emacs</a>, and <a href="http://emacs-fu.blogspot.com/">Emacs Fu</a>.
</p>

<p>
Various religious texts granting Emacs users various powers (such as
reading <a href="http://www.emacswiki.org/emacs/CategoryMail">email</a>, <a href="http://www.emacswiki.org/emacs/CategoryChatClient">chatting</a>, <a href="http://www.emacswiki.org/emacs/Twitter">tweeting</a>, <a href="http://www.emacswiki.org/emacs/CategoryGames">playing games</a>, <a href="http://www.emacswiki.org/emacs/MusicPlayers">listening to music</a>)
can be found at the <a href="http://www.emacswiki.org/emacs/">Emacs Wiki</a>. 
</p>
</div>
</div>

<div id="outline-container-sec-1-5-3" class="outline-4">
<h4 id="sec-1-5-3">Vim</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
If Emacs is like Catholicism, then Vim is like Buddhism.  Vim is the
modern incarnation of vi, a modal text editor that descended from ed.
The modal way of editing is by expressing in a few keystrokes how the
text should be manipulated.  This is in contrast to Emacs, where text
is manipulated directly.  This fundamental difference is the source of
much confusion for new users, and is also why many people recommend
Emacs as "being easier to learn." This should not deter new users from
learning vi(m), as its editing facilities are substantial.
</p>

<p>
A functional <code>.vimrc</code> looks like:
</p>
<pre class="example">
syntax on
set cursorline
set hlsearch
set ic
set incsearch
set ruler
set shiftwidth=4
set tabstop=4
set wrap
</pre>

<p>
To learn Vim, type <code>vimtutor</code> at the command lime and follow the
instructions. Take your time, and repeat the tutorial once or twice
over a few days.  In the mean time editors such as <code>gedit</code> or <code>nano</code>
offer a more traditional experience.  As your Vim skills improve, you
will feel more comfortable with Vim and can stop using the less
powerful editors.  
</p>

<p>
Some useful links include:
</p>
<ul class="org-ul">
<li><a href="http://derekwyatt.org/vim/tutorials/">Vim Videos</a> Tutorial videos by Derek Wyatt, the novice videos are
must see if you are new to vi(m)
</li>
<li><a href="http://www.vimgenius.com/">Vim Genius</a> a drill website for learning Vim commands
</li>
<li><a href="https://www.liquidweb.com/kb/overview-of-vim-text-editor/">New user Vim Tutorial</a>
</li>
<li><a href="http://blog.sanctum.geek.nz/vim-koans/">Vim Koans</a> tidbits of wisdom to ponder
</li>
<li><a href="http://www.vim.org/scripts/">A collection of extensions and plugins for Vim</a>
</li>
<li><a href="http://val.markovic.io/blog/youcompleteme-a-fast-as-you-type-fuzzy-search-code-completion-engine-for-vim">YouCompleteMe</a> A Vim autocompletion engine for editing. 
</li>
</ul>
</div>
</div>
