index.org
*** Others
Followers of the Unix way realize that there are situations where a
using a set of shell commands piped together may fit the task at hand
more efficiently than either of the other two editors.  Tools you
should be familiar with are:
- [[http://www.grymoire.com/Unix/Sed.html][sed]] and [[http://sed.sourceforge.net/sed1line.txt][one-liners]]
- [[http://www.grymoire.com/Unix/Awk.html][awk]] and [[http://www.pement.org/awk/awk1line.txt][one-liners]]
- [[http://perl-tutorial.org/][perl]] (and its [[https://en.wikipedia.org/wiki/Black_Perl][poetry]])
- [[http://www.thegeekstuff.com/2009/03/15-practical-unix-grep-command-examples/][grep]]
- Heretics exist which exhort the use of [[http://linux.die.net/man/1/pico][pico]] or even [[http://linux.die.net/man/1/nano][nano]]. 
[[http://regex.info/blog/2006-09-15/247][Always keep in mind]]
#+BEGIN_QUOTE
Some people, when confronted with a problem, think
"I know, I'll use regular expressions."   Now they have two
problems. -- Jaimie Zawinski
#+END_QUOTE

** Software Design
Well designed software is a true marvel, in the same way architecture
is a marvel.  You are a stone mason, and you are building a cathedral.
Repeat that last sentence every time you want to take a shortcut when
coding. A cathedral can't stand on a flimsy foundation.

In order to help you on your way, you should read the following:
- [[http://aosabook.org/en/index.html][Architecture of Open Source Applications]]
- [[https://www.thc.org/root/phun/unmaintain.html][How to Write Unmaintainable Code]] (*warning*, many physicists take this
  guide literally)

Good software design is *very* hard, but when you have the pleasure of
using well designed software, it is a true joy. Some examples of good
HEP software:
- [[http://rivet.hepforge.org/][Rivet]]: Robust Independent Validation of Experiment and Theory
- [[http://fastjet.fr][Fastjet]]: Software package for jet finding

** A brief introduction to C++ 
C++ is the industry standard programming language for analysis in
HEP.  Even if you are fortunate enough to do most of your work in
Python, you will eventually be calling C++ code, and should
understand some core concepts in order to debug problems should they
arise.

Things to keep in mind: 
- This portion of the guide covers C++ at a high level.  Very little
  [[http://www.cplusplus.com/tutorial][specific syntax]] will be covered.  When you have a C++ question,
  google is your friend.
- When writing in any language, prefer that languages idioms.  Don't
  write python in C++, C in C++ or C++ in python.
- C++ is a vast language, however being familiar with its roots, C,
  is invaluable.
- If faced with a decision between learning C++ vs Python, prefer
  C++.  C++'s syntax is more rigid and requires more overhead.  Once
  you know C++, python is much easier to pick up.
- There's always an exception to the rule, just make sure it's the
  right exception!

C++ is an imperative, object oriented language.  It started out as a
"C with classes" but has since bolted on significant language
features different from C.  Proficiency with C++ should be aimed
towards comfortable use of the template meta-programming features of
the language, although it is entirely possible to spend an entire
career writing C++ without exercising this feature (just read the ROOT
source code). 
