docs/index.html
<div id="outline-container-sec-1-5-4" class="outline-4">
<h4 id="sec-1-5-4">Others</h4>
<div class="outline-text-4" id="text-1-5-4">
<p>
Followers of the Unix way realize that there are situations where a
using a set of shell commands piped together may fit the task at hand
more efficiently than either of the other two editors.  Tools you
should be familiar with are:
</p>
<ul class="org-ul">
<li><a href="http://www.grymoire.com/Unix/Sed.html">sed</a> and <a href="http://sed.sourceforge.net/sed1line.txt">one-liners</a>
</li>
<li><a href="http://www.grymoire.com/Unix/Awk.html">awk</a> and <a href="http://www.pement.org/awk/awk1line.txt">one-liners</a>
</li>
<li><a href="http://perl-tutorial.org/">perl</a> (and its <a href="https://en.wikipedia.org/wiki/Black_Perl">poetry</a>)
</li>
<li><a href="http://www.thegeekstuff.com/2009/03/15-practical-unix-grep-command-examples/">grep</a>
</li>
<li>Heretics exist which exhort the use of <a href="http://linux.die.net/man/1/pico">pico</a> or even <a href="http://linux.die.net/man/1/nano">nano</a>. 
</li>
</ul>
<p>
<a href="http://regex.info/blog/2006-09-15/247">Always keep in mind</a>
</p>
<blockquote>
<p>
Some people, when confronted with a problem, think
"I know, I'll use regular expressions."   Now they have two
problems. &#x2013; Jaimie Zawinski
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Software Design</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Well designed software is a true marvel, in the same way architecture
is a marvel.  You are a stone mason, and you are building a cathedral.
Repeat that last sentence every time you want to take a shortcut when
coding. A cathedral can't stand on a flimsy foundation.
</p>

<p>
In order to help you on your way, you should read the following:
</p>
<ul class="org-ul">
<li><a href="http://aosabook.org/en/index.html">Architecture of Open Source Applications</a>
</li>
<li><a href="https://www.thc.org/root/phun/unmaintain.html">How to Write Unmaintainable Code</a> (<b>warning</b>, many physicists take this
guide literally)
</li>
</ul>

<p>
Good software design is <b>very</b> hard, but when you have the pleasure of
using well designed software, it is a true joy. Some examples of good
HEP software:
</p>
<ul class="org-ul">
<li><a href="http://rivet.hepforge.org/">Rivet</a>: Robust Independent Validation of Experiment and Theory
</li>
<li><a href="http://fastjet.fr">Fastjet</a>: Software package for jet finding
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">A brief introduction to C++</h3>
<div class="outline-text-3" id="text-1-7">
<p>
C++ is the industry standard programming language for analysis in
HEP.  Even if you are fortunate enough to do most of your work in
Python, you will eventually be calling C++ code, and should
understand some core concepts in order to debug problems should they
arise.
</p>

<p>
Things to keep in mind: 
</p>
<ul class="org-ul">
<li>This portion of the guide covers C++ at a high level.  Very little
<a href="http://www.cplusplus.com/tutorial">specific syntax</a> will be covered.  When you have a C++ question,
google is your friend.
</li>
<li>When writing in any language, prefer that languages idioms.  Don't
write python in C++, C in C++ or C++ in python.
</li>
<li>C++ is a vast language, however being familiar with its roots, C,
is invaluable.
</li>
<li>If faced with a decision between learning C++ vs Python, prefer
C++.  C++'s syntax is more rigid and requires more overhead.  Once
you know C++, python is much easier to pick up.
</li>
<li>There's always an exception to the rule, just make sure it's the
right exception!
</li>
</ul>

<p>
C++ is an imperative, object oriented language.  It started out as a
"C with classes" but has since bolted on significant language
features different from C.  Proficiency with C++ should be aimed
towards comfortable use of the template meta-programming features of
the language, although it is entirely possible to spend an entire
career writing C++ without exercising this feature (just read the ROOT
source code). 
</p>
</div>
