index.org
*** Pointers
[[http://www.chiark.greenend.org.uk/~sgtatham/cdescent/][Required Reading: The Descent to C]]

As C++ has evolved from C, it retains parts of C's low level nature.
Part of this is the need to be explicit about managing memory
manually.  This is in stark contrast to languages such as Java or
Python where memory management is handled for the programmer.

A consequence of this is the ability to address specific cells of
memory (the smallest accessible unit, typically a byte).  An object
(=int=, =double=, =float=, =char=, =string=, etc) may span several
memory cells.  A pointer is the computer's representation of a memory
cell's location in memory, ie a memory address.  Ultimately the
programmer is interested in the data contained in the set of memory
cells "pointed to" by the pointer.  The act of retrieving this data is
called "/dereferencing/ a pointer".

As in physics, facility with manipulating pointers is best gained
through experience, however many analogies have been developed to ease
confusion.  One analogy is street addresses, A street address is a
sequence of numbers (the pointer) which instructs someone, a mailman
say, (the computer), how to find a specific location. Once at that
location, it is possible to manipulate objects located at that address
(deliver mail if your the mailman, break the mailbox if your a bored
teenager, knock on the door if you are a vacuum salesman etc).

Now some syntax:
#+BEGIN_SRC cpp
  Foo* bar = new Foo("Baz",42,"What is the question?");
  std::cout << "object bar lives at memory address:"<<bar<<std::endl;
  std::cout << "bar calculated a question to the answer to \"The Ultimate Question\" as "<<bar->TheAnswer()<<std::endl;
  std::cout <<"Another way to get the answer is: "<<(*bar).TheAnswer()<<std::endl;
#+END_SRC
Lots of interesting things have been introduced here.  Let's look at a
possible output of this program:
#+BEGIN_EXAMPLE
object bar lives at memory address: 0xd29ad0
bar calculated a question to the answer to "The Ultimate Question" as "What is 6x9?"
Another way to get the answer is: "What is 6x9?"
#+END_EXAMPLE
What happened? Let's look at the first line
#+BEGIN_SRC cpp
  Foo* bar = new Foo("Baz",42,"What is the question?");
#+END_SRC
=Foo*= is a pointer of type =Foo=. It's an address to a chunk of memory
that contains an instance of =Foo=.  
#+BEGIN_QUOTE
Question: Why does the compiler need to know that it's a Foo type object at that address? 
#+END_QUOTE
#+BEGIN_QUOTE
Answer: Foo might fall across several memory cells, in which case the
compiler must know how many memory cells to move if you ask for the
bar+1 spot. In fact, in C there is a concept called the void*, a
type-less pointer that is an address to anything.  It is the
programmer's responsibility to cast the void* to the correct type.
#+END_QUOTE

OK, so we have a pointer to an object of type =Foo= called =bar=.
#+BEGIN_QUOTE
Question: What happens on the right hand side of the assignment operator (=)?
#+END_QUOTE
#+BEGIN_QUOTE
Answer: C++ reserves the keyword "new" for memory allocation.  The
"new" keyword takes a class constructor on the right hand side, and
returns a memory address on the left hand side.  This address gets
stored in the variable =bar=.  
#+END_QUOTE

Operationally, the "new" keyword allocates a chunk of memory to hold
the object on the right hand side, and returns a pointer to the
beginning of the chunk.  

What happens when we want to access the memory that the pointer points
to? There is another operation called "dereferencing" which goes to
the address pointed to and returns the object contained at that point
in memory.  Consider the following snippet:
#+BEGIN_SRC cpp
double* foo = new double(3.14159);
double pi = *foo;
std::cout <<"Pi is: "<<pi<<std::endl;
#+END_SRC
Here, a chunk of memory has the value 3.14159 written to it, then
that value is retrieved and stored in another location of memory
called =pi=.  That data is the written out the terminal by
=std::cout= and =std::endl=.

Now we can understand this line:
#+BEGIN_SRC cpp
  std::cout <<"Another way to get the answer is: "<<(*bar).TheAnswer()<<std::endl;
#+END_SRC
It means, retrieve the object pointed to by =bar=, and call the method
"=TheAnswer()=" on it.  Programmers abhor syntax that can easily get
them into trouble, so the language designers (of c) added a shorthand
for this kind of operation (the =->= operator):
#+BEGIN_SRC cpp
  Foo* bar=new Foo();
  if(bar->Value()==(*bar).Value()){
    std::cout<<"They're the same!"<<std::endl;
  }
#+END_SRC
Quiz: What will the output of this snippet be?

**** Why are pointer's useful at all?
Clever hitchhikers will notice that this appears to be a bunch of
bureaucratic mucking about with pointless details, most of the time it
is.  Since most of HEP deals with pointless details bureaucratically,
a lot of HEP code uses pointers.

To understand the real purpose of pointers, we must examine [[https://stackoverflow.com/questions/22146094/why-should-i-use-a-pointer-rather-than-the-object-itself?newsletter%3D1&nlcode%3D47931|9e27][dynamic
allocation]]. Consider the following code:
#+BEGIN_SRC cpp
  double* foo(){
    double* bar = new double(0.0);
  
    {
      double baz=42;
      *bar=baz;//dereference bar, and store the value of baz 
    }
    //baz is out of scope
    return bar;
  }
  int main(void){
    double* foobar=foo();
    std::cout <<"The Answer to the Ultimate question is :"<<*foobar<<std::endl;
    return 0;
  }
#+END_SRC
Let's execute the code in our mind:
1. execute =main(void)=
2. a =double*= named =foobar= is allocated.
3. =foo()= is executed
   1. a =double*= named =bar= is allocated
   2. new initializes a =double= with value 0.0
   3. new assigns the address containing that =double= to =bar=
   4. enter the braces, intialize a =double= named =baz= with value 42
   5. dereference =bar= and copy the value of =baz= into it
   6. exit the braces and free the memory where =baz= was
   7. return the address containing the value of =bar=;
4. Assign the value returned by =foo()= to =foobar=
5. stream the string "The Answer..." to stdout
6. dereference =*foobar= to obtain the value stored at =bar=, 42, stream
   that to stdout
7. add a newline to the output and flush the result to the terminal
   with =std::endl=
8. return 0
9. exit the program
