docs/index.html
<div id="outline-container-sec-1-7-1" class="outline-4">
<h4 id="sec-1-7-1">Pointers</h4>
<div class="outline-text-4" id="text-1-7-1">
<p>
<a href="http://www.chiark.greenend.org.uk/~sgtatham/cdescent/">Required Reading: The Descent to C</a>
</p>

<p>
As C++ has evolved from C, it retains parts of C's low level nature.
Part of this is the need to be explicit about managing memory
manually.  This is in stark contrast to languages such as Java or
Python where memory management is handled for the programmer.
</p>

<p>
A consequence of this is the ability to address specific cells of
memory (the smallest accessible unit, typically a byte).  An object
(<code>int</code>, <code>double</code>, <code>float</code>, <code>char</code>, <code>string</code>, etc) may span several
memory cells.  A pointer is the computer's representation of a memory
cell's location in memory, ie a memory address.  Ultimately the
programmer is interested in the data contained in the set of memory
cells "pointed to" by the pointer.  The act of retrieving this data is
called "<i>dereferencing</i> a pointer".
</p>

<p>
As in physics, facility with manipulating pointers is best gained
through experience, however many analogies have been developed to ease
confusion.  One analogy is street addresses, A street address is a
sequence of numbers (the pointer) which instructs someone, a mailman
say, (the computer), how to find a specific location. Once at that
location, it is possible to manipulate objects located at that address
(deliver mail if your the mailman, break the mailbox if your a bored
teenager, knock on the door if you are a vacuum salesman etc).
</p>

<p>
Now some syntax:
</p>
<div class="org-src-container">

<pre class="src src-cpp">Foo* bar = new Foo("Baz",42,"What is the question?");
std::cout &lt;&lt; "object bar lives at memory address:"&lt;&lt;bar&lt;&lt;std::endl;
std::cout &lt;&lt; "bar calculated a question to the answer to \"The Ultimate Question\" as "&lt;&lt;bar-&gt;TheAnswer()&lt;&lt;std::endl;
std::cout &lt;&lt;"Another way to get the answer is: "&lt;&lt;(*bar).TheAnswer()&lt;&lt;std::endl;
</pre>
</div>
<p>
Lots of interesting things have been introduced here.  Let's look at a
possible output of this program:
</p>
<pre class="example">
object bar lives at memory address: 0xd29ad0
bar calculated a question to the answer to "The Ultimate Question" as "What is 6x9?"
Another way to get the answer is: "What is 6x9?"
</pre>
<p>
What happened? Let's look at the first line
</p>
<div class="org-src-container">

<pre class="src src-cpp">Foo* bar = new Foo("Baz",42,"What is the question?");
</pre>
</div>
<p>
<code>Foo*</code> is a pointer of type <code>Foo</code>. It's an address to a chunk of memory
that contains an instance of <code>Foo</code>.  
</p>
<blockquote>
<p>
Question: Why does the compiler need to know that it's a Foo type object at that address? 
</p>
</blockquote>
<blockquote>
<p>
Answer: Foo might fall across several memory cells, in which case the
compiler must know how many memory cells to move if you ask for the
bar+1 spot. In fact, in C there is a concept called the void*, a
type-less pointer that is an address to anything.  It is the
programmer's responsibility to cast the void* to the correct type.
</p>
</blockquote>

<p>
OK, so we have a pointer to an object of type <code>Foo</code> called <code>bar</code>.
</p>
<blockquote>
<p>
Question: What happens on the right hand side of the assignment operator (=)?
</p>
</blockquote>
<blockquote>
<p>
Answer: C++ reserves the keyword "new" for memory allocation.  The
"new" keyword takes a class constructor on the right hand side, and
returns a memory address on the left hand side.  This address gets
stored in the variable <code>bar</code>.  
</p>
</blockquote>

<p>
Operationally, the "new" keyword allocates a chunk of memory to hold
the object on the right hand side, and returns a pointer to the
beginning of the chunk.  
</p>

<p>
What happens when we want to access the memory that the pointer points
to? There is another operation called "dereferencing" which goes to
the address pointed to and returns the object contained at that point
in memory.  Consider the following snippet:
</p>
<div class="org-src-container">

<pre class="src src-cpp">double* foo = new double(3.14159);
double pi = *foo;
std::cout &lt;&lt;"Pi is: "&lt;&lt;pi&lt;&lt;std::endl;
</pre>
</div>
<p>
Here, a chunk of memory has the value 3.14159 written to it, then
that value is retrieved and stored in another location of memory
called <code>pi</code>.  That data is the written out the terminal by
<code>std::cout</code> and <code>std::endl</code>.
</p>

<p>
Now we can understand this line:
</p>
<div class="org-src-container">

<pre class="src src-cpp">std::cout &lt;&lt;"Another way to get the answer is: "&lt;&lt;(*bar).TheAnswer()&lt;&lt;std::endl;
</pre>
</div>
<p>
It means, retrieve the object pointed to by <code>bar</code>, and call the method
"<code>TheAnswer()</code>" on it.  Programmers abhor syntax that can easily get
them into trouble, so the language designers (of c) added a shorthand
for this kind of operation (the <code>-&gt;</code> operator):
</p>
<div class="org-src-container">

<pre class="src src-cpp">Foo* bar=new Foo();
if(bar-&gt;Value()==(*bar).Value()){
  std::cout&lt;&lt;"They're the same!"&lt;&lt;std::endl;
}
</pre>
</div>
<p>
Quiz: What will the output of this snippet be?
</p>
</div>

<div id="outline-container-sec-1-7-1-1" class="outline-5">
<h5 id="sec-1-7-1-1">Why are pointer's useful at all?</h5>
<div class="outline-text-5" id="text-1-7-1-1">
<p>
Clever hitchhikers will notice that this appears to be a bunch of
bureaucratic mucking about with pointless details, most of the time it
is.  Since most of HEP deals with pointless details bureaucratically,
a lot of HEP code uses pointers.
</p>

<p>
To understand the real purpose of pointers, we must examine <a href="https://stackoverflow.com/questions/22146094/why-should-i-use-a-pointer-rather-than-the-object-itself?newsletter=1&nlcode=47931|9e27">dynamic
allocation</a>. Consider the following code:
</p>
<div class="org-src-container">

<pre class="src src-cpp">double* foo(){
  double* bar = new double(0.0);

  {
    double baz=42;
    *bar=baz;//dereference bar, and store the value of baz 
  }
  //baz is out of scope
  return bar;
}
int main(void){
  double* foobar=foo();
  std::cout &lt;&lt;"The Answer to the Ultimate question is :"&lt;&lt;*foobar&lt;&lt;std::endl;
  return 0;
}
</pre>
</div>
<p>
Let's execute the code in our mind:
</p>
<ol class="org-ol">
<li>execute <code>main(void)</code>
</li>
<li>a <code>double*</code> named <code>foobar</code> is allocated.
</li>
<li><code>foo()</code> is executed
<ol class="org-ol">
<li>a <code>double*</code> named <code>bar</code> is allocated
</li>
<li>new initializes a <code>double</code> with value 0.0
</li>
<li>new assigns the address containing that <code>double</code> to <code>bar</code>
</li>
<li>enter the braces, intialize a <code>double</code> named <code>baz</code> with value 42
</li>
<li>dereference <code>bar</code> and copy the value of <code>baz</code> into it
</li>
<li>exit the braces and free the memory where <code>baz</code> was
</li>
<li>return the address containing the value of <code>bar</code>;
</li>
</ol>
</li>
<li>Assign the value returned by <code>foo()</code> to <code>foobar</code>
</li>
<li>stream the string "The Answer&#x2026;" to stdout
</li>
<li>dereference <code>*foobar</code> to obtain the value stored at <code>bar</code>, 42, stream
that to stdout
</li>
<li>add a newline to the output and flush the result to the terminal
with <code>std::endl</code>
</li>
<li>return 0
</li>
<li>exit the program
</li>
</ol>
</div>
</div>
