docs/index.html
<div id="outline-container-sec-1-7-1-2" class="outline-5">
<h5 id="sec-1-7-1-2">References</h5>
<div class="outline-text-5" id="text-1-7-1-2">
<p>
A similar concept present in C++ (but not c) are references.  They can
be thought of as aliases (the way Dave is an alias of David). Their
syntax is:
</p>
<div class="org-src-container">

<pre class="src src-cpp">int foo=42;
int&amp; theAnswer=foo;
foo=0;
std::cout&lt;&lt;theAnswer&lt;&lt;std::endl;
</pre>
</div>
<p>
Here foo is initialized to the value 42, then a reference named
theAnswer is declared and assigned to foo.  All this does is make a
new name for the same object.  What does the program output?
</p>

<p>
The answer is 0.  References seem pointless (pun intended) until
they're used in function definitions:
</p>
<div class="org-src-container">

<pre class="src src-cpp">void bar(int&amp; foo){
  //complicated calculation for foo
  foo++;
}
int main(void){
  int baz=41;
  bar(baz);
  std::cout&lt;&lt;baz&lt;&lt;std::endl;
}
</pre>
</div>
<blockquote>
<p>
Question: What is the output of this program?  
</p>
</blockquote>
<blockquote>
<p>
Answer: 42  
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-sec-1-7-2" class="outline-4">
<h4 id="sec-1-7-2">Methods</h4>
<div class="outline-text-4" id="text-1-7-2">
<p>
Methods, or functions are defined as:
</p>
<div class="org-src-container">

<pre class="src src-cpp">return_type function_name(arg1_type arg1, arg2_type arg2, ...){
  //statements that define function_name
}
</pre>
</div>
<p>
It is possible to "forward declare" functions, these are "promises to
the compiler" that you have a function with a particular signature:
</p>
<div class="org-src-container">

<pre class="src src-cpp">double foo(double,double);
// important other stuff
double foo(double theta, double phi){
  return sin(theta)*sin(theta) + cos(phi)*cos(phi);
}
</pre>
</div>
<p>
Notice that the compiler doesn't need to know the names of the
arguments in the forward declaration.  
</p>

<p>
Before we move onto the next topic, a note on methods.  Most of the
time during development, you only have a few helper functions.  This
is fine! Just write your helper functions in a header file, and
include them.  Write the main function and move on with your life.
There are many examples in HEP, where methods have been pigeon-holed
into classes.  The result is a cumbersome interface for the user
(YOU!) or more importantly your supervisor.  With that in mind, lets
move on to classes.
</p>
</div>
</div>
<div id="outline-container-sec-1-7-3" class="outline-4">
<h4 id="sec-1-7-3">Classes</h4>
<div class="outline-text-4" id="text-1-7-3">
<p>
STOP! Read the last paragraph of the previous section.  
</p>

<p>
Now, ask yourself: Do I really need a class?  
No. Ok, great!
</p>

<p>
Yes. Are you sure?  Maybe your needs are better served with a few
functions and a well defined interface.
</p>

<p>
Do you have complicated data structures that need to be operated on
by many methods? No? Maybe your needs are better served with a few
functions and a well defined interface.
</p>

<p>
Yes? Maybe you should rethink your design.  
</p>

<p>
You've rethought it and realized that you have to use a class because
the person before you did, now there isn't a clean way to do it any
other way.  OK, classes.
</p>

<blockquote>
<p>
Editor's Note: Our dear reader may have been studying this guide and
thought to themselves: "Gee wiz, there is a lot of great advice here,
I should follow this exactly or dragons might eat my analysis
program!"  While this may be a possibility, the previous advice on
classes may be a little, well, misguided.
</p>

<p>
More sound advice may sound like this: When beginning development,
make your first (and maybe second) drafts of the program without
classes.  This will force you to recognize which parts of your program
fit together (data+methods) and which are separate.  Then, revise your
program to include classes with the appropriate encapsulation of data
and methods.  This will ensure that you write a clean interface, and
that you don't end up with 20 methods that all take the same four
arguments.
</p>
</blockquote>

<p>
The basic syntax is:
</p>
<div class="org-src-container">

<pre class="src src-cpp">class A{
public:
  A():a(0),b(0){};
  A(int _a):a(_a),b(0){};
  ~A(){};
  void SetA(int new_a){a=new_a;};
  void GetA(){return a;};
  void SetB(int new_b){b=new_b;};
  void GetB(){return b;};
private:
  int a;
protected:
  int b;
};
</pre>
</div>
<p>
This is a trivial example, and it breaks many rules about naming
conventions and clarity.  It is not a good example.  It should not be
used as a good example to win arguments about concise code.  In fact,
you probably shouldn't have read it.
</p>

<p>
Important features of the code: Anything after the public keyword is
accessible to the outside world, ie:
</p>
<div class="org-src-container">

<pre class="src src-cpp">A myObj;
myObj.SetA(10);
myObj.GetA();
myObj.SetB(42);
myObj.GetB();
</pre>
</div>
<p>
Is all valid code, anything that is written after private, is just
that.  You cannot access it outside of the class:
</p>
<div class="org-src-container">

<pre class="src src-cpp">myObj.a; //Compiler error
myObj.b; //protected is a special form of private
</pre>
</div>
<p>
The protected keyword is for class inheritance.  It says that these
variables and methods are private for users of the class, but if
another class inherits from this one, they inherit these symbols. 
</p>

<p>
Normally in class inheritance, you only inherit the public members of
the class.  The private members are not inherited.  Protected offers
a way to encapsulate data, but also share data among inheritance
diagrams.
</p>

<p>
In case you haven't picked up on it, classes are one of the hairier
aspects of C++.  It's better if you refer to some other resource for a
tutorial on classes, as their subtleties are beyond the scope of The
Guide.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">An even briefer introduction to Python</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Python is a wonderful language.  It is expressive and allows rapid
prototyping with a shell type environment.  <a href="http://learnpythonthehardway.org/book/">Try learning it the hard
way</a>.  Another approach is to google what you're trying to do, and
make it run on a small test case.  
</p>

<p>
When writing code, it is best to be idiomatic.  This is especially
true in python.  Python's driving philosophy is "one right way" but
since python is being developed by multiple hackers, there are "many
right ways." 
</p>

<ul class="org-ul">
<li>Here's an older tutorial on <a href="http://python.net/~goodger/projects/pycon/2007/idiomatic/handout.html">idiomatic python</a>.  
</li>
<li><a href="http://safehammad.com/downloads/python-idioms-2014-01-16.pdf">A slideshow on idiomatic python</a>
</li>
<li><a href="https://en.wikibooks.org/wiki/Non-Programmer's_Tutorial_for_Python_3">A non-programmer's tutorial on python 3</a> (also see the linked version
for 2.7 as HEP is still using 2.7 or earlier in many cases)
</li>
<li>Finally, the <a href="http://docs.python.org/2/howto/doanddont.html">official recommendations</a> for best practices.
</li>
</ul>
</div>

<div id="outline-container-sec-1-8-1" class="outline-4">
<h4 id="sec-1-8-1">PyROOT: ROOT bindings in python</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
Mostly Harmless.
</p>
</div>
</div>
</div>
