index.org
** ROOT
For better or worse, for richer or poorer (always poorer), HEP
Physicists are married to (read: stuck with) ROOT.  It's the [[http://homes.cs.washington.edu/~weise/uhh-download.html][Unix]] of
HEP.  There is method in the madness, though it is not clear what the
method is (just yet). The Editor is fairly certain that ROOT uses
[[https://en.wikipedia.org/wiki/Bistromath#Bistromathic_drive][Bistromath]]ics for many of its statistical operations.

ROOT is the industry standard tool for analyzing and manipulating gobs
of data.  Other statistical analysis tools [[http://www.matthewckeller.com/html/memory.html][crash and burn]] on the
datasets that ROOT eats for breakfast.  

Recently, ROOT has begun the transition from the 5 series to the 6
series. This transition has resulted in huge changes to the front and
back-end of ROOT. Below there will be some comparisons to both
versions.  When something applies to the 5 series, it will be
annotated ROOTv5.  It should be assumed that ROOT or ROOTv6 refers to
the newest 6 series.  Without further ado, let's set it up and get to
work!
*** Installing and setting up
**** On Windows
These links are for 5.34.34. You are encouraged visit the [[http://root.cern.ch/drupal/content/downloading-root][downloading]]
page of root.cern.ch to check for newer versions.  Always prefer the
"pro" version.  It appears that in ROOT 6, the developers have stopped
releasing windows builds. This means that to use ROOT 6 and above
you'll have to either compile from source, or use a virtual machine.

- [[https://root.cern.ch/download/root_v5.34.34.win32.vc12.exe][VC++11 (2012) EXE for 5.34.34]] (install-able version, allows you to
  remove it using the Control Panel)
**** On MacOS
If you are using =homebrew= you can simply do:
#+BEGIN_SRC sh
brew tap homebrew/science
brew install --with-cocoa root
#+END_SRC
([[https://alexpearce.me/2013/12/root-on-os-x-mavericks/][source]])
**** On Ubuntu
This will install all ROOT packages from the Ubuntu repositories:
#+BEGIN_SRC sh
sudo apt-get install root-system
#+END_SRC

*** Building From source
These instructions are for *nix based systems (ie it was written for
Ubuntu, but MacOS shouldn't be much different and Windows is out of
the question).

When choosing a version of ROOT, always pick the 'pro' (pro for
production) version.  It's the latest, stable, version recommended by
the ROOT Devs. 

*Nota Bene* If you're doing this on Mac OS, you'll need to use =brew
install blah= instead of =apt-get install blah=, and the package names
will probably be different. 

If you haven't yet, read the [[*For%20Linux%20Hitchhikers][section of the guide]] relevant to your OS.

For our install of ROOT, we'll be compiling and running it locally.
This has a few advantages:
- "Uninstalling" is easy, either unset the environment variables
  pointing to ROOT, or completely delete the folder that root lives
  in (in this example =~/root=)
- Having multiple versions side-by-side is possible, you could have:
  - =~/root-clang= a version of root compiled with clang
  - =~/root-5.34= a stable version of ROOT
  - =~/root-5.99= the beta version of ROOT 6
  - To use any of them you would just have to source
    =~/root-ver/bin/thisroot.sh=
- You don't need root (administrative) access on the machine (as long
  as the pre-req's are installed).  This is generally nice since it
  decouples ROOT from the hosting OS.  

**** Getting the Pre-Requisites
Now, all of the following information is documented at
[[root.cern.ch]], but it is even less organized than this guide. The
following is a straight-shot from no source code to a fully working
ROOT binary on a clean install of Ubuntu (currently 13.10, but the
build process has been stable for the last ~3 years)

End to end, this takes ~40min on a machine circa 2011, so budget some
coffee time.  

#+BEGIN_SRC sh
sudo apt-get install git dpkg-dev make g++ gcc binutils libx11-dev libxpm-dev \
        libxft-dev libxext-dev gfortran libssl-dev libpcre3-dev \
        xlibmesa-glu-dev libglew1.5-dev libftgl-dev \
        libmysqlclient-dev libfftw3-dev cfitsio-dev \
        graphviz-dev libavahi-compat-libdnssd-dev \
        libldap2-dev python-dev libxml2-dev libkrb5-dev \
        libgsl0-dev libqt4-dev
#+END_SRC
You may have some of these packages already if you've installed
=build-essential= or =git= before.  In either case, =apt= is smart
enough to see that and not re-install them. 

The above list of packages are for a full-blown,
all-features-enabled  version of ROOT.  If you want a stripped down
version, you'll have to get the pre-reqs from [[http://root.cern.ch]]. 

Alternatively you can type:
#+BEGIN_SRC sh
sudo apt-get build-dep root-system
#+END_SRC
And let =apt= install and manage any dependencies ROOT needs.  This
is overkill, even for a "bells and whistles" build of ROOT.
**** May the Source be with you
Let's get a copy of the source:
#+BEGIN_SRC sh
git clone http://root.cern.ch/git/root.git
#+END_SRC

For future reference, if you want to update:
#+BEGIN_SRC sh
git pull
git tag -l 
git checkout -b tag-name tag-name
#+END_SRC
=git tag -l= lists all the available tags, choose the one you want
and substitute it for =tag-name=

For now, lets checkout the latest pro branch:
#+BEGIN_SRC sh
git checkout -b v6-04-14 v6-04-14
#+END_SRC
This will checkout the branch =v6-04-14= to a local branch =v6-04-14=
and switch you to it. If you're new to "[[https://en.wikipedia.org/wiki/Version_control_systems][version control systems]]", or
"[[https://en.wikipedia.org/wiki/Source_code_management][source control management]]" then it's useful to do a tutorial to learn
the basics.  In HEP, the major system used is called SVN, in open
source, Git has become the de facto standard almost overnight.
