docs/index.html

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9">ROOT</h3>
<div class="outline-text-3" id="text-1-9">
<p>
For better or worse, for richer or poorer (always poorer), HEP
Physicists are married to (read: stuck with) ROOT.  It's the <a href="http://homes.cs.washington.edu/~weise/uhh-download.html">Unix</a> of
HEP.  There is method in the madness, though it is not clear what the
method is (just yet). The Editor is fairly certain that ROOT uses
<a href="https://en.wikipedia.org/wiki/Bistromath#Bistromathic_drive">Bistromath</a>ics for many of its statistical operations.
</p>

<p>
ROOT is the industry standard tool for analyzing and manipulating gobs
of data.  Other statistical analysis tools <a href="http://www.matthewckeller.com/html/memory.html">crash and burn</a> on the
datasets that ROOT eats for breakfast.  
</p>

<p>
Recently, ROOT has begun the transition from the 5 series to the 6
series. This transition has resulted in huge changes to the front and
back-end of ROOT. Below there will be some comparisons to both
versions.  When something applies to the 5 series, it will be
annotated ROOTv5.  It should be assumed that ROOT or ROOTv6 refers to
the newest 6 series.  Without further ado, let's set it up and get to
work!
</p>
</div>
<div id="outline-container-sec-1-9-1" class="outline-4">
<h4 id="sec-1-9-1">Installing and setting up</h4>
<div class="outline-text-4" id="text-1-9-1">
</div><div id="outline-container-sec-1-9-1-1" class="outline-5">
<h5 id="sec-1-9-1-1">On Windows</h5>
<div class="outline-text-5" id="text-1-9-1-1">
<p>
These links are for 5.34.34. You are encouraged visit the <a href="http://root.cern.ch/drupal/content/downloading-root">downloading</a>
page of root.cern.ch to check for newer versions.  Always prefer the
"pro" version.  It appears that in ROOT 6, the developers have stopped
releasing windows builds. This means that to use ROOT 6 and above
you'll have to either compile from source, or use a virtual machine.
</p>

<ul class="org-ul">
<li><a href="https://root.cern.ch/download/root_v5.34.34.win32.vc12.exe">VC++11 (2012) EXE for 5.34.34</a> (install-able version, allows you to
remove it using the Control Panel)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-9-1-2" class="outline-5">
<h5 id="sec-1-9-1-2">On MacOS</h5>
<div class="outline-text-5" id="text-1-9-1-2">
<p>
If you are using <code>homebrew</code> you can simply do:
</p>
<div class="org-src-container">

<pre class="src src-sh">brew tap homebrew/science
brew install --with-cocoa root
</pre>
</div>
<p>
(<a href="https://alexpearce.me/2013/12/root-on-os-x-mavericks/">source</a>)
</p>
</div>
</div>
<div id="outline-container-sec-1-9-1-3" class="outline-5">
<h5 id="sec-1-9-1-3">On Ubuntu</h5>
<div class="outline-text-5" id="text-1-9-1-3">
<p>
This will install all ROOT packages from the Ubuntu repositories:
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install root-system
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-9-2" class="outline-4">
<h4 id="sec-1-9-2">Building From source</h4>
<div class="outline-text-4" id="text-1-9-2">
<p>
These instructions are for *nix based systems (ie it was written for
Ubuntu, but MacOS shouldn't be much different and Windows is out of
the question).
</p>

<p>
When choosing a version of ROOT, always pick the 'pro' (pro for
production) version.  It's the latest, stable, version recommended by
the ROOT Devs. 
</p>

<p>
<b>Nota Bene</b> If you're doing this on Mac OS, you'll need to use <code>brew
install blah</code> instead of <code>apt-get install blah</code>, and the package names
will probably be different. 
</p>

<p>
If you haven't yet, read the <i>section of the guide</i> relevant to your OS.
</p>

<p>
For our install of ROOT, we'll be compiling and running it locally.
This has a few advantages:
</p>
<ul class="org-ul">
<li>"Uninstalling" is easy, either unset the environment variables
pointing to ROOT, or completely delete the folder that root lives
in (in this example <code>~/root</code>)
</li>
<li>Having multiple versions side-by-side is possible, you could have:
<ul class="org-ul">
<li><code>~/root-clang</code> a version of root compiled with clang
</li>
<li><code>~/root-5.34</code> a stable version of ROOT
</li>
<li><code>~/root-5.99</code> the beta version of ROOT 6
</li>
<li>To use any of them you would just have to source
<code>~/root-ver/bin/thisroot.sh</code>
</li>
</ul>
</li>
<li>You don't need root (administrative) access on the machine (as long
as the pre-req's are installed).  This is generally nice since it
decouples ROOT from the hosting OS.  
</li>
</ul>
</div>

<div id="outline-container-sec-1-9-2-1" class="outline-5">
<h5 id="sec-1-9-2-1">Getting the Pre-Requisites</h5>
<div class="outline-text-5" id="text-1-9-2-1">
<p>
Now, all of the following information is documented at
<i>root.cern.ch</i>, but it is even less organized than this guide. The
following is a straight-shot from no source code to a fully working
ROOT binary on a clean install of Ubuntu (currently 13.10, but the
build process has been stable for the last ~3 years)
</p>

<p>
End to end, this takes ~40min on a machine circa 2011, so budget some
coffee time.  
</p>

<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install git dpkg-dev make g++ gcc binutils libx11-dev libxpm-dev \
	libxft-dev libxext-dev gfortran libssl-dev libpcre3-dev \
	xlibmesa-glu-dev libglew1.5-dev libftgl-dev \
	libmysqlclient-dev libfftw3-dev cfitsio-dev \
	graphviz-dev libavahi-compat-libdnssd-dev \
	libldap2-dev python-dev libxml2-dev libkrb5-dev \
	libgsl0-dev libqt4-dev
</pre>
</div>
<p>
You may have some of these packages already if you've installed
<code>build-essential</code> or <code>git</code> before.  In either case, <code>apt</code> is smart
enough to see that and not re-install them. 
</p>

<p>
The above list of packages are for a full-blown,
all-features-enabled  version of ROOT.  If you want a stripped down
version, you'll have to get the pre-reqs from <a href="http://root.cern.ch">http://root.cern.ch</a>. 
</p>

<p>
Alternatively you can type:
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get build-dep root-system
</pre>
</div>
<p>
And let <code>apt</code> install and manage any dependencies ROOT needs.  This
is overkill, even for a "bells and whistles" build of ROOT.
</p>
</div>
</div>
<div id="outline-container-sec-1-9-2-2" class="outline-5">
<h5 id="sec-1-9-2-2">May the Source be with you</h5>
<div class="outline-text-5" id="text-1-9-2-2">
<p>
Let's get a copy of the source:
</p>
<div class="org-src-container">

<pre class="src src-sh">git clone http://root.cern.ch/git/root.git
</pre>
</div>

<p>
For future reference, if you want to update:
</p>
<div class="org-src-container">

<pre class="src src-sh">git pull
git tag -l 
git checkout -b tag-name tag-name
</pre>
</div>
<p>
<code>git tag -l</code> lists all the available tags, choose the one you want
and substitute it for <code>tag-name</code>
</p>

<p>
For now, lets checkout the latest pro branch:
</p>
<div class="org-src-container">

<pre class="src src-sh">git checkout -b v6-04-14 v6-04-14
</pre>
</div>
<p>
This will checkout the branch <code>v6-04-14</code> to a local branch <code>v6-04-14</code>
and switch you to it. If you're new to "<a href="https://en.wikipedia.org/wiki/Version_control_systems">version control systems</a>", or
"<a href="https://en.wikipedia.org/wiki/Source_code_management">source control management</a>" then it's useful to do a tutorial to learn
the basics.  In HEP, the major system used is called SVN, in open
source, Git has become the de facto standard almost overnight.
</p>
</div>
</div>
