index.org
**** Building 
With our code checked out and ready, we need to configure it to match
the computer we're compiling on.  To do this:
#+BEGIN_SRC sh
./configure --all 
#+END_SRC
To see all options run =./configure --help=, this command suggests
piping the output to =more=, but most "modern" terminal emulators have
a scroll-back buffer large enough that you can just scroll up and read
the output.  The =--all= option instructs configure to enable support
for as many packages as your system supports.  If you require a
specific feature (say roofit) you would type:
#+BEGIN_SRC sh
./configure [other options] --enable-roofit
#+END_SRC

If you're interested in building ROOT with xrootd (network protocol
which allows opening root files over a network connection) see
[[*Advanced%20Build%20Options][Advanced Build Options]].

After configuring you should see:
#+BEGIN_EXAMPLE
Enabled support for asimage, astiff, builtin_afterimage, builtin_llvm, explicitlink, fftw3, gviz, gdml, genvector, http, krb5, ldap, mathmore, memstat, minuit2, mysql, opengl, python, qt, qtgsi, roofit, search_usrlocal, shadowpw, shared, sqlite, ssl, table, tmva, unuran, vc, vdt, x11, xft, xml.

To build ROOT type:

   make 
#+END_EXAMPLE

Now type =make=:
#+BEGIN_SRC sh
make -j 4 
#+END_SRC
The =-j= option tells make how many jobs it can run simultaneously.
Without =-j=, only one job runs.  A good rule of thumb is to choose
the number of cores you have on your computer.  If you are compiling
on remote computer, it is probably shared by others, in which it is
good etiquette to run your jobs single threaded.  On your laptop, you
should choose *one less* than the number of cores you have (so you
don't notice a slow-down while its building in the background).

See =man make= and look under the option "-j [jobs]" for more
detailed information about this switch.

This will take (depending on your hardware) between 20-45min, so now
is a good time for a cup of tea, or coffee with your [[*Keeping%20your%20Guru%20happy][editor guru]].

When it's finished, it will print out:
#+BEGIN_EXAMPLE
[lots of boring crap]

   ============================================================
   ===                ROOT BUILD SUCCESSFUL.                ===
   === Run 'source bin/thisroot.[c]sh' before starting ROOT ===
   ============================================================
#+END_EXAMPLE
If you do not get this message, but the build just ends with =[lots of
boring crap]= find a senior grad student and have them look at the
=[lots of boring crap]= (it won't be boring to them). They will be
able to instruct you on what went wrong. 

If you don't have a senior grad student handy, try googling some of
the output and seeing if you can get anywhere.  There is also the
[[http://root.cern.ch/phpBB3/viewforum.php?f%3D3&sid%3Db8e88bc1be4e5f599aedd95aeb047349][ROOT Talk Forums]].  
**** Using your new superpower
Now, when you want to use =root=, you can run the command:
#+BEGIN_SRC sh
source ~/root/bin/thisroot.sh
#+END_SRC
If you are using tcsh (you shouldn't be) you would need to run:
#+BEGIN_SRC sh
source ~/root/bin/thisroot.csh
#+END_SRC

There are differing opinions about whether or not you should put
something like this in your bashrc.  One school of thought (especially
applicable when you bounce between different versions) is that you
should keep your environment as clean as possible and only setup what
you need.  In that case adding:
#+BEGIN_SRC sh
alias setupROOT='source ${HOME}/root/bin/thisroot.sh'
#+END_SRC
To your =~/.bashrc= file is enough.

Then, whenever you need root, you have to run =setupROOT=, before you
can run =root=.

Another school of thought is that, you should always have some copy
of root available if possible.  In that case the following will
always setup root when bash runs if the setup file exists:
#+BEGIN_SRC sh
[ -f ~/root/bin/thisroot.sh ] && source ~/root/bin/thisroot.sh
#+END_SRC

Now you can start root by typing =root= at the command line.  You
should see:
#+BEGIN_EXAMPLE
   ----------------------------------------------------------------
  | Welcome to ROOT 6.07/03                    http://root.cern.ch |
  |                                   (c) 1995-2016, The ROOT Team |
  | Built for linuxx8664gcc                                        |
  | From heads/master@v6-07-02-292-g1c873d2, Feb 04 2016, 12:28:28 |
  | Try '.help', '.demo', '.license', '.credits', '.quit'/'.q'     |
   ----------------------------------------------------------------

root [0]
#+END_EXAMPLE
*In ROOTv5*:
#+BEGIN_EXAMPLE
  *******************************************
  *                                         *
  *        W E L C O M E  to  R O O T       *
  *                                         *
  *   Version   5.34/15  11 February 2014   *
  *                                         *
  *  You are welcome to visit our Web site  *
  *          http://root.cern.ch            *
  *                                         *
  *******************************************

ROOT 5.34/15 (v5-34-15@v5-34-15, Mar 21 2014, 14:04:01 on linuxx8664gcc)

CINT/ROOT C/C++ Interpreter version 5.18.00, July 2, 2010
Type ? for help. Commands must be C++ statements.
Enclose multiple statements between { }.
root [0]
#+END_EXAMPLE

To start root without the splash screen type =root -l= in which case
you see:
#+BEGIN_EXAMPLE
root [0]
#+END_EXAMPLE

