docs/index.html
<div id="outline-container-sec-1-9-2-3" class="outline-5">
<h5 id="sec-1-9-2-3">Building</h5>
<div class="outline-text-5" id="text-1-9-2-3">
<p>
With our code checked out and ready, we need to configure it to match
the computer we're compiling on.  To do this:
</p>
<div class="org-src-container">

<pre class="src src-sh">./configure --all
</pre>
</div>
<p>
To see all options run <code>./configure --help</code>, this command suggests
piping the output to <code>more</code>, but most "modern" terminal emulators have
a scroll-back buffer large enough that you can just scroll up and read
the output.  The <code>--all</code> option instructs configure to enable support
for as many packages as your system supports.  If you require a
specific feature (say roofit) you would type:
</p>
<div class="org-src-container">

<pre class="src src-sh">./configure [other options] --enable-roofit
</pre>
</div>

<p>
If you're interested in building ROOT with xrootd (network protocol
which allows opening root files over a network connection) see
<a href="#sec-1-9-3">Advanced Build Options</a>.
</p>

<p>
After configuring you should see:
</p>
<pre class="example">
Enabled support for asimage, astiff, builtin_afterimage, builtin_llvm, explicitlink, fftw3, gviz, gdml, genvector, http, krb5, ldap, mathmore, memstat, minuit2, mysql, opengl, python, qt, qtgsi, roofit, search_usrlocal, shadowpw, shared, sqlite, ssl, table, tmva, unuran, vc, vdt, x11, xft, xml.

To build ROOT type:

   make
</pre>

<p>
Now type <code>make</code>:
</p>
<div class="org-src-container">

<pre class="src src-sh">make -j 4
</pre>
</div>
<p>
The <code>-j</code> option tells make how many jobs it can run simultaneously.
Without <code>-j</code>, only one job runs.  A good rule of thumb is to choose
the number of cores you have on your computer.  If you are compiling
on remote computer, it is probably shared by others, in which it is
good etiquette to run your jobs single threaded.  On your laptop, you
should choose <b>one less</b> than the number of cores you have (so you
don't notice a slow-down while its building in the background).
</p>

<p>
See <code>man make</code> and look under the option "-j [jobs]" for more
detailed information about this switch.
</p>

<p>
This will take (depending on your hardware) between 20-45min, so now
is a good time for a cup of tea, or coffee with your <i>editor guru</i>.
</p>

<p>
When it's finished, it will print out:
</p>
<pre class="example">
[lots of boring crap]

   ============================================================
   ===                ROOT BUILD SUCCESSFUL.                ===
   === Run 'source bin/thisroot.[c]sh' before starting ROOT ===
   ============================================================
</pre>
<p>
If you do not get this message, but the build just ends with <code>[lots of
boring crap]</code> find a senior grad student and have them look at the
<code>[lots of boring crap]</code> (it won't be boring to them). They will be
able to instruct you on what went wrong. 
</p>

<p>
If you don't have a senior grad student handy, try googling some of
the output and seeing if you can get anywhere.  There is also the
<a href="http://root.cern.ch/phpBB3/viewforum.php?f=3&sid=b8e88bc1be4e5f599aedd95aeb047349">ROOT Talk Forums</a>.  
</p>
</div>
</div>
<div id="outline-container-sec-1-9-2-4" class="outline-5">
<h5 id="sec-1-9-2-4">Using your new superpower</h5>
<div class="outline-text-5" id="text-1-9-2-4">
<p>
Now, when you want to use <code>root</code>, you can run the command:
</p>
<div class="org-src-container">

<pre class="src src-sh">source ~/root/bin/thisroot.sh
</pre>
</div>
<p>
If you are using tcsh (you shouldn't be) you would need to run:
</p>
<div class="org-src-container">

<pre class="src src-sh">source ~/root/bin/thisroot.csh
</pre>
</div>

<p>
There are differing opinions about whether or not you should put
something like this in your bashrc.  One school of thought (especially
applicable when you bounce between different versions) is that you
should keep your environment as clean as possible and only setup what
you need.  In that case adding:
</p>
<div class="org-src-container">

<pre class="src src-sh">alias setupROOT='source ${HOME}/root/bin/thisroot.sh'
</pre>
</div>
<p>
To your <code>~/.bashrc</code> file is enough.
</p>

<p>
Then, whenever you need root, you have to run <code>setupROOT</code>, before you
can run <code>root</code>.
</p>

<p>
Another school of thought is that, you should always have some copy
of root available if possible.  In that case the following will
always setup root when bash runs if the setup file exists:
</p>
<div class="org-src-container">

<pre class="src src-sh">[ -f ~/root/bin/thisroot.sh ] &amp;&amp; source ~/root/bin/thisroot.sh
</pre>
</div>

<p>
Now you can start root by typing <code>root</code> at the command line.  You
should see:
</p>
<pre class="example">
   ----------------------------------------------------------------
  | Welcome to ROOT 6.07/03                    http://root.cern.ch |
  |                                   (c) 1995-2016, The ROOT Team |
  | Built for linuxx8664gcc                                        |
  | From heads/master@v6-07-02-292-g1c873d2, Feb 04 2016, 12:28:28 |
  | Try '.help', '.demo', '.license', '.credits', '.quit'/'.q'     |
   ----------------------------------------------------------------

root [0]
</pre>
<p>
<b>In ROOTv5</b>:
</p>
<pre class="example">
  *******************************************
  *                                         *
  *        W E L C O M E  to  R O O T       *
  *                                         *
  *   Version   5.34/15  11 February 2014   *
  *                                         *
  *  You are welcome to visit our Web site  *
  *          http://root.cern.ch            *
  *                                         *
  *******************************************

ROOT 5.34/15 (v5-34-15@v5-34-15, Mar 21 2014, 14:04:01 on linuxx8664gcc)

CINT/ROOT C/C++ Interpreter version 5.18.00, July 2, 2010
Type ? for help. Commands must be C++ statements.
Enclose multiple statements between { }.
root [0]
</pre>

<p>
To start root without the splash screen type <code>root -l</code> in which case
you see:
</p>
<pre class="example">
root [0]
</pre>
</div>
</div>
</div>
