index.org
*** Advanced Build Options
[[http://root.cern.ch/drupal/content/installing-xrootd][Full instructions here]]

If you want to use xrootd, you'll also need cmake:
#+BEGIN_SRC sh
apt-get install cmake
#+END_SRC
Then, (from the directory where you checked out =root=):
#+BEGIN_SRC sh
./build/unix/installXrootd.sh 
#+END_SRC
This will install xrootd to whatever directory you're currently in,
so if you want it installed somewhere else, cd to that directory
first, just make sure that you update the location in the next command.

Now when you configure root you should use:
#+BEGIN_SRC sh
./configure --all --with-xrootd=${HOME}/root/xrootd-4.2.1/
#+END_SRC
Here =${HOME}/root/xrootd-4.2.1/= is the path where xrootd was
installed (based on the =installXrootd.sh= script above).  If you
blindly follow the instructions the above command will "just work".

*Nota Bene* The path following =--with-xrootd== must be a fully
qualified path (ie =/home/username/root/xrootd-4.2.1/=), the
configure script doesn't understand that =~/= is a shorthand for
=${HOME}=. 

if =xrootd= support has been enabled you should see:
#+BEGIN_EXAMPLE
Enabled support for asimage, astiff, builtin_afterimage, builtin_llvm, explicitlink, fftw3, gviz, gdml, genvector, http, krb5, ldap, mathmore, memstat, minuit2, mysql, opengl, python, qt, qtgsi, roofit, search_usrlocal, shadowpw, shared, sqlite, ssl, table, tmva, unuran, vc, vdt, x11, xft, xml, xrootd.

To build ROOT type:

   make 

#+END_EXAMPLE

Make sure you see =xrootd= in the list! If not xrootd won't be
installed and won't function properly. You can now continue with the
[[*Installing%20and%20setting%20up][regular instructions]]. *Note*: If you want to be able to access files
hosted at CERN, you'll have to have a kerberos client installed
(either =krb5-user= or =heimdal-clients= on debian or ubuntu systems).  Then
before connecting, run =kinit -5 ${CERN_USER}@CERN.CH= to generate a
kerberos certificate. 

*** A Path to ROOT enlightenment
There are three methods of running code through ROOT to produce
results.  These methods are listed below, each more sophisticated
than the last.  They also include example code intended as a starting
point for hacking.   

As a reminder, see [[*Obtaining%20a%20copy%20and%20supporting%20material][Obtaining a copy and supporting material]] for
instructions on obtaining and running the example code.
**** Level 1: Macros
The first, and simplest way to execute ROOT related code is the
humble macro. A macro is a set of ROOT commands enclosed by
braces. For example:
#+BEGIN_SRC cpp
  {
    TFile* file= TFile::Open("MeaningOfLife.root");
    TH1F* hist = (TH1F*)file->Get("Hist1");
    cout << hist->GetNbinsX() <<endl;
  }
#+END_SRC
*For ROOT 6:*
ROOTv6 macros are compiled with the LLVM backend "just in time"
(JIT). This means that you have to type valid C++ in order to make
things work correctly.  This alleviates a lot of the issues that make
Macros fragile, and so it is easier to transition from Level 1 to
Level 2, and you can achieve more with a macro than before.

*For ROOT 5:*
While not immediately obvious, ROOTv5 macros are not written in C or
C++, but [[http://root.cern.ch/drupal/content/cint][CINT]]. CINT covers "most of"   ANSI C and ISO C++ 2003.
There are some important differences:
- =foo.blah= and =foo->blah= are interchangeable
- a semicolon ';' at the end of a line is optional
- No need to "=#include=" headers
As you progress in writing more sophisticated C++, you will run into
CINT's shortcomings as a C++ interpreter.  It is recommended that you
move to Level 2 or 3 before this happens. 

While it is possible to write complicated CINT macros (files with
multiple function definitions) it is not recommended.  CINT has a
habit of keeping up the appearance of doing one thing when in reality
something entirely different is happening "behind the scenes".

CINT is best used for quick scripts to plot histograms already saved
to a disk, or to inspect a few branches from a =TTree=.  More
sophisticated analyses are better served by Levels 2 and 3. 

**** Level 2: Compiled Macros
Compiled macros are full-blown C++ programs.  Generally there is a
"steering macro" that handles compiling and loading the required
libraries.  An example steering macro:
#+BEGIN_SRC cpp
{
  //may need to load other libraries or files that depend on analysis.C
  gROOT->ProcessLine(".L analysis.C++");
  gROOT->ProcessLine("doAnalysis()");
}
#+END_SRC
The compiled macro itself looks more like a traditional C++ program:
#+BEGIN_SRC cpp
#include <cstdlib>
#include "TFile.h"
#include "TH1F.h"

int doAnalysis(){
  
  return 42;
}
#+END_SRC
Since the ROOT binary already defines a "main" an error will occur
if you redefine another function named "main", therefore we use
the verb "doAnalysis". 

The steering macro that compiles each source file can become
arbitrarily complex.  To some this may read "flexible", to others it
may read "disorganized".  If your analysis grows into a multi-file
program, it's probably time to ascend to Level 3.

**** Level 3: Compiled Programs
A compiled program is just that. Here ROOT takes the role of a rich
set of libraries for composing a C++ based analysis.  

An example program (and supporting Makefile) [[https://github.com/dbjergaard/hitchhikers-guide-to-hep/tree/master/compiled-program][is included here]].

Makefiles come with their own overhead, but the =make= system is very
powerful.  The [[https://www.gnu.org/software/make/manual/make.html][make manual]] is very readable with many examples.  

**** A note on Enlightenment
Master Foo, of [[http://www.catb.org/~esr//writings/unix-koans/][Rootless Root]], gives the [[http://www.catb.org/~esr//writings/unix-koans/shell-tools.html][sage advice]]:
#+BEGIN_QUOTE
"When you are hungry, eat; when you are thirsty, drink; when you are tired, sleep."
#+END_QUOTE

To spell it out (and to prevent the reader from enlightenment), it is
wise to choose the use of ROOT which is most appropriate for a task
at hand.  The practicing HEP physicist is proficient with all three
levels, and can pick and choose which approach is best for the task
at hand.  

