docs/index.html

<div id="outline-container-sec-1-9-3" class="outline-4">
<h4 id="sec-1-9-3">Advanced Build Options</h4>
<div class="outline-text-4" id="text-1-9-3">
<p>
<a href="http://root.cern.ch/drupal/content/installing-xrootd">Full instructions here</a>
</p>

<p>
If you want to use xrootd, you'll also need cmake:
</p>
<div class="org-src-container">

<pre class="src src-sh">apt-get install cmake
</pre>
</div>
<p>
Then, (from the directory where you checked out <code>root</code>):
</p>
<div class="org-src-container">

<pre class="src src-sh">./build/unix/installXrootd.sh
</pre>
</div>
<p>
This will install xrootd to whatever directory you're currently in,
so if you want it installed somewhere else, cd to that directory
first, just make sure that you update the location in the next command.
</p>

<p>
Now when you configure root you should use:
</p>
<div class="org-src-container">

<pre class="src src-sh">./configure --all --with-xrootd=${HOME}/root/xrootd-4.2.1/
</pre>
</div>
<p>
Here <code>${HOME}/root/xrootd-4.2.1/</code> is the path where xrootd was
installed (based on the <code>installXrootd.sh</code> script above).  If you
blindly follow the instructions the above command will "just work".
</p>

<p>
<b>Nota Bene</b> The path following <code>--with-xrootd=</code> must be a fully
qualified path (ie <code>/home/username/root/xrootd-4.2.1/</code>), the
configure script doesn't understand that <code>~/</code> is a shorthand for
<code>${HOME}</code>. 
</p>

<p>
if <code>xrootd</code> support has been enabled you should see:
</p>
<pre class="example">
Enabled support for asimage, astiff, builtin_afterimage, builtin_llvm, explicitlink, fftw3, gviz, gdml, genvector, http, krb5, ldap, mathmore, memstat, minuit2, mysql, opengl, python, qt, qtgsi, roofit, search_usrlocal, shadowpw, shared, sqlite, ssl, table, tmva, unuran, vc, vdt, x11, xft, xml, xrootd.

To build ROOT type:

   make
</pre>

<p>
Make sure you see <code>xrootd</code> in the list! If not xrootd won't be
installed and won't function properly. You can now continue with the
<i>regular instructions</i>. <b>Note</b>: If you want to be able to access files
hosted at CERN, you'll have to have a kerberos client installed
(either <code>krb5-user</code> or <code>heimdal-clients</code> on debian or ubuntu systems).  Then
before connecting, run <code>kinit -5 ${CERN_USER}@CERN.CH</code> to generate a
kerberos certificate. 
</p>
</div>
</div>

<div id="outline-container-sec-1-9-4" class="outline-4">
<h4 id="sec-1-9-4">A Path to ROOT enlightenment</h4>
<div class="outline-text-4" id="text-1-9-4">
<p>
There are three methods of running code through ROOT to produce
results.  These methods are listed below, each more sophisticated
than the last.  They also include example code intended as a starting
point for hacking.   
</p>

<p>
As a reminder, see <a href="#sec-1-1-3">Obtaining a copy and supporting material</a> for
instructions on obtaining and running the example code.
</p>
</div>
<div id="outline-container-sec-1-9-4-1" class="outline-5">
<h5 id="sec-1-9-4-1">Level 1: Macros</h5>
<div class="outline-text-5" id="text-1-9-4-1">
<p>
The first, and simplest way to execute ROOT related code is the
humble macro. A macro is a set of ROOT commands enclosed by
braces. For example:
</p>
<div class="org-src-container">

<pre class="src src-cpp">{
  TFile* file= TFile::Open("MeaningOfLife.root");
  TH1F* hist = (TH1F*)file-&gt;Get("Hist1");
  cout &lt;&lt; hist-&gt;GetNbinsX() &lt;&lt;endl;
}
</pre>
</div>
<p>
<b>For ROOT 6:</b>
ROOTv6 macros are compiled with the LLVM backend "just in time"
(JIT). This means that you have to type valid C++ in order to make
things work correctly.  This alleviates a lot of the issues that make
Macros fragile, and so it is easier to transition from Level 1 to
Level 2, and you can achieve more with a macro than before.
</p>

<p>
<b>For ROOT 5:</b>
While not immediately obvious, ROOTv5 macros are not written in C or
C++, but <a href="http://root.cern.ch/drupal/content/cint">CINT</a>. CINT covers "most of"   ANSI C and ISO C++ 2003.
There are some important differences:
</p>
<ul class="org-ul">
<li><code>foo.blah</code> and <code>foo-&gt;blah</code> are interchangeable
</li>
<li>a semicolon ';' at the end of a line is optional
</li>
<li>No need to "<code>#include</code>" headers
</li>
</ul>
<p>
As you progress in writing more sophisticated C++, you will run into
CINT's shortcomings as a C++ interpreter.  It is recommended that you
move to Level 2 or 3 before this happens. 
</p>

<p>
While it is possible to write complicated CINT macros (files with
multiple function definitions) it is not recommended.  CINT has a
habit of keeping up the appearance of doing one thing when in reality
something entirely different is happening "behind the scenes".
</p>

<p>
CINT is best used for quick scripts to plot histograms already saved
to a disk, or to inspect a few branches from a <code>TTree</code>.  More
sophisticated analyses are better served by Levels 2 and 3. 
</p>
</div>
</div>

<div id="outline-container-sec-1-9-4-2" class="outline-5">
<h5 id="sec-1-9-4-2">Level 2: Compiled Macros</h5>
<div class="outline-text-5" id="text-1-9-4-2">
<p>
Compiled macros are full-blown C++ programs.  Generally there is a
"steering macro" that handles compiling and loading the required
libraries.  An example steering macro:
</p>
<div class="org-src-container">

<pre class="src src-cpp">{
  //may need to load other libraries or files that depend on analysis.C
  gROOT-&gt;ProcessLine(".L analysis.C++");
  gROOT-&gt;ProcessLine("doAnalysis()");
}
</pre>
</div>
<p>
The compiled macro itself looks more like a traditional C++ program:
</p>
<div class="org-src-container">

<pre class="src src-cpp">#include &lt;cstdlib&gt;
#include "TFile.h"
#include "TH1F.h"

int doAnalysis(){

  return 42;
}
</pre>
</div>
<p>
Since the ROOT binary already defines a "main" an error will occur
if you redefine another function named "main", therefore we use
the verb "doAnalysis". 
</p>

<p>
The steering macro that compiles each source file can become
arbitrarily complex.  To some this may read "flexible", to others it
may read "disorganized".  If your analysis grows into a multi-file
program, it's probably time to ascend to Level 3.
</p>
</div>
</div>

<div id="outline-container-sec-1-9-4-3" class="outline-5">
<h5 id="sec-1-9-4-3">Level 3: Compiled Programs</h5>
<div class="outline-text-5" id="text-1-9-4-3">
<p>
A compiled program is just that. Here ROOT takes the role of a rich
set of libraries for composing a C++ based analysis.  
</p>

<p>
An example program (and supporting Makefile) <a href="https://github.com/dbjergaard/hitchhikers-guide-to-hep/tree/master/compiled-program">is included here</a>.
</p>

<p>
Makefiles come with their own overhead, but the <code>make</code> system is very
powerful.  The <a href="https://www.gnu.org/software/make/manual/make.html">make manual</a> is very readable with many examples.  
</p>
</div>
</div>

<div id="outline-container-sec-1-9-4-4" class="outline-5">
<h5 id="sec-1-9-4-4">A note on Enlightenment</h5>
<div class="outline-text-5" id="text-1-9-4-4">
<p>
Master Foo, of <a href="http://www.catb.org/~esr//writings/unix-koans/">Rootless Root</a>, gives the <a href="http://www.catb.org/~esr//writings/unix-koans/shell-tools.html">sage advice</a>:
</p>
<blockquote>
<p>
"When you are hungry, eat; when you are thirsty, drink; when you are tired, sleep."
</p>
</blockquote>

<p>
To spell it out (and to prevent the reader from enlightenment), it is
wise to choose the use of ROOT which is most appropriate for a task
at hand.  The practicing HEP physicist is proficient with all three
levels, and can pick and choose which approach is best for the task
at hand.  
</p>
</div>
</div>
</div>
