index.org
*** PyROOT
PyROOT are a set of python bindings to ROOT. It works fairly well out
of the box, but there are some things to keep in mind. 
- Idiomatic python avoids "=from ROOT import *=", prefer "=from ROOT
  import blah="
- the ROOT devs know you aren't going to be idiomatic, so instead
  they've implemented a lazy loading system (ROOT is huge, so "=from
  ROOT import *=" would take forever).  This may be confusing if your
  a python expert and expect exploration commands like =dir()= to
  work with ROOT.
- If performance matters, try to stay in C++ land (ie call C++
  functions from python) as much as possible
  - If performance really matters, write it in python and then port
    it to C++. This is fairly advanced, but not impossible. You'll
    have to generate CINT dictionaries for your source files.
If you're looking for a more "pythonic" (not my word) experience,
maybe give [[http://www.rootpy.org][rootpy]] a shot. See also [[*An%20even%20briefer%20introduction%20to%20Python][An even briefer introduction to
Python]] for resources to learn python itself.

*** Fitting Data with RooFit
RooFit is a shiny penny compared to the rest of the ROOT ecosystem.
It has its own quirks and idioms, but the interfaces are fairly
reasonable and the manual is well written.  The latest version of the
manual and quickstart can always be found here:
- [[http://root.cern.ch/drupal/content/users-guide#roofit][ROOT User's guide,  Roofit Manual]]
Direct links are here, though they aren't guaranteed to be current:
- [[http://root.cern.ch/download/doc/RooFit_Users_Manual_2.91-33.pdf][RooFit Manual (PDF) 2.91-33]]
- [[http://root.cern.ch/drupal/sites/default/files/roofit_quickstart_3.00.pdf][RooFit Quick Start Guide (PDF) 3.00]]
*** Styling Plots 
A well designed graph is truly a work of art. The path from paltry
graphics spit out by ROOT to something worthy of framing (and yes,
[[https://www.edwardtufte.com/tufte/posters][truly amazing data visualizations are routinely framed]]) is long and
fraught with naysayers who will insist that you are doing it wrong.
Ignore them, and do what needs to be done to communicate your hard won
data clearly and concisely.  To get you started, give "[[http://www2.cs.uregina.ca/~rbm/cs100/notes/spreadsheets/tufte_paper.html][Principles of
Information Display for Visualization Practitioners]]" a read.  It is an
executive summary of [[https://www.edwardtufte.com/tufte/][Edward Tufte's]] works on visualizing information.
If what you read resonates with you, then please read [[http://www.amazon.com/The-Visual-Display-Quantitative-Information/dp/0961392142][Tufte's books]].
They make for delightful coffee time distractions.  After reading his
books you will start to see his influence in particularly nice
graphics.  You will also see many sins committed by other
practitioners in our field. Choose your role-models wisely.

Sage advice (passed down from The Editor's first mentor):
#+BEGIN_QUOTE
When you make a plot, take the time to make it publication quality
and reproducible.  
#+END_QUOTE
This means two things:
1. Make it good enough to go into a paper
2. Prefer generating it with C++/Python over any other format (data
   inputs will frequently change at the last minute, and being able to
   "hit a button" and get the plot is very useful unless you have a
   room full of [[https://en.wikipedia.org/wiki/The_Turk][Mechanical Turks]] lying around)

This also means it's probably a good idea to keep =*.root= files
containing your histograms for last minute style changes if you are
writing a presentation.

Producing a publication quality plot can be challenging, however ROOT
includes the concept of a "Style" which can be applied.  These are
global rules for how plots should be printed.  In previous versions of
ROOT, the default style was notoriously bad.  In The Editor's humble
opinion, this was done to simultaneously encourage each physicist to
set their own standard, and to immediately identify ROOT newbies from
seasoned ROOT hackers.

Now, things are better, though the idea that "each physicist set their
own standard" has stuck, and so there are many styles floating
around. 
