docs/index.html

<div id="outline-container-sec-1-9-5" class="outline-4">
<h4 id="sec-1-9-5">PyROOT</h4>
<div class="outline-text-4" id="text-1-9-5">
<p>
PyROOT are a set of python bindings to ROOT. It works fairly well out
of the box, but there are some things to keep in mind. 
</p>
<ul class="org-ul">
<li>Idiomatic python avoids "<code>from ROOT import *</code>", prefer "<code>from ROOT
  import blah</code>"
</li>
<li>the ROOT devs know you aren't going to be idiomatic, so instead
they've implemented a lazy loading system (ROOT is huge, so "<code>from
  ROOT import *</code>" would take forever).  This may be confusing if your
a python expert and expect exploration commands like <code>dir()</code> to
work with ROOT.
</li>
<li>If performance matters, try to stay in C++ land (ie call C++
functions from python) as much as possible
<ul class="org-ul">
<li>If performance really matters, write it in python and then port
it to C++. This is fairly advanced, but not impossible. You'll
have to generate CINT dictionaries for your source files.
</li>
</ul>
</li>
</ul>
<p>
If you're looking for a more "pythonic" (not my word) experience,
maybe give <a href="http://www.rootpy.org">rootpy</a> a shot. See also <a href="#sec-1-8">An even briefer introduction to Python</a> for resources to learn python itself.
</p>
</div>
</div>

<div id="outline-container-sec-1-9-6" class="outline-4">
<h4 id="sec-1-9-6">Fitting Data with RooFit</h4>
<div class="outline-text-4" id="text-1-9-6">
<p>
RooFit is a shiny penny compared to the rest of the ROOT ecosystem.
It has its own quirks and idioms, but the interfaces are fairly
reasonable and the manual is well written.  The latest version of the
manual and quickstart can always be found here:
</p>
<ul class="org-ul">
<li><a href="http://root.cern.ch/drupal/content/users-guide#roofit">ROOT User's guide,  Roofit Manual</a>
</li>
</ul>
<p>
Direct links are here, though they aren't guaranteed to be current:
</p>
<ul class="org-ul">
<li><a href="http://root.cern.ch/download/doc/RooFit_Users_Manual_2.91-33.pdf">RooFit Manual (PDF) 2.91-33</a>
</li>
<li><a href="http://root.cern.ch/drupal/sites/default/files/roofit_quickstart_3.00.pdf">RooFit Quick Start Guide (PDF) 3.00</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-9-7" class="outline-4">
<h4 id="sec-1-9-7">Styling Plots</h4>
<div class="outline-text-4" id="text-1-9-7">
<p>
A well designed graph is truly a work of art. The path from paltry
graphics spit out by ROOT to something worthy of framing (and yes,
<a href="https://www.edwardtufte.com/tufte/posters">truly amazing data visualizations are routinely framed</a>) is long and
fraught with naysayers who will insist that you are doing it wrong.
Ignore them, and do what needs to be done to communicate your hard won
data clearly and concisely.  To get you started, give "<a href="http://www2.cs.uregina.ca/~rbm/cs100/notes/spreadsheets/tufte_paper.html">Principles of
Information Display for Visualization Practitioners</a>" a read.  It is an
executive summary of <a href="https://www.edwardtufte.com/tufte/">Edward Tufte's</a> works on visualizing information.
If what you read resonates with you, then please read <a href="http://www.amazon.com/The-Visual-Display-Quantitative-Information/dp/0961392142">Tufte's books</a>.
They make for delightful coffee time distractions.  After reading his
books you will start to see his influence in particularly nice
graphics.  You will also see many sins committed by other
practitioners in our field. Choose your role-models wisely.
</p>

<p>
Sage advice (passed down from The Editor's first mentor):
</p>
<blockquote>
<p>
When you make a plot, take the time to make it publication quality
and reproducible.  
</p>
</blockquote>
<p>
This means two things:
</p>
<ol class="org-ol">
<li>Make it good enough to go into a paper
</li>
<li>Prefer generating it with C++/Python over any other format (data
inputs will frequently change at the last minute, and being able to
"hit a button" and get the plot is very useful unless you have a
room full of <a href="https://en.wikipedia.org/wiki/The_Turk">Mechanical Turks</a> lying around)
</li>
</ol>

<p>
This also means it's probably a good idea to keep <code>*.root</code> files
containing your histograms for last minute style changes if you are
writing a presentation.
</p>

<p>
Producing a publication quality plot can be challenging, however ROOT
includes the concept of a "Style" which can be applied.  These are
global rules for how plots should be printed.  In previous versions of
ROOT, the default style was notoriously bad.  In The Editor's humble
opinion, this was done to simultaneously encourage each physicist to
set their own standard, and to immediately identify ROOT newbies from
seasoned ROOT hackers.
</p>

<p>
Now, things are better, though the idea that "each physicist set their
own standard" has stuck, and so there are many styles floating
around. 
</p>
</div>
