docs/index.html
<div id="outline-container-sec-1-9-7-1" class="outline-5">
<h5 id="sec-1-9-7-1">Example Style</h5>
<div class="outline-text-5" id="text-1-9-7-1">
<p>
An example style (probably from the CMS TDR, the details are lost to
time):
</p>
<div class="org-src-container">

<pre class="src src-cpp">{
  TStyle *tdrStyle = new TStyle("tdrStyle","Style for P-TDR");

  cout &lt;&lt; "TDR Style initialized" &lt;&lt; endl;

// For the canvas:
  tdrStyle-&gt;SetCanvasBorderMode(0);
  tdrStyle-&gt;SetCanvasColor(kWhite);
  tdrStyle-&gt;SetCanvasDefH(600); //Height of canvas
  tdrStyle-&gt;SetCanvasDefW(600); //Width of canvas
  tdrStyle-&gt;SetCanvasDefX(0);   //Position on screen
  tdrStyle-&gt;SetCanvasDefY(0);

// For the Pad:
  tdrStyle-&gt;SetPadBorderMode(0);
  // tdrStyle-&gt;SetPadBorderSize(Width_t size = 1);
  tdrStyle-&gt;SetPadColor(kWhite);
  tdrStyle-&gt;SetPadGridX(false);
  tdrStyle-&gt;SetPadGridY(false);
  tdrStyle-&gt;SetGridColor(0);
  tdrStyle-&gt;SetGridStyle(3);
  tdrStyle-&gt;SetGridWidth(1);

// For the frame:
  tdrStyle-&gt;SetFrameBorderMode(0);
  tdrStyle-&gt;SetFrameBorderSize(1);
  tdrStyle-&gt;SetFrameFillColor(0);
  tdrStyle-&gt;SetFrameFillStyle(0);
  tdrStyle-&gt;SetFrameLineColor(1);
  tdrStyle-&gt;SetFrameLineStyle(1);
  tdrStyle-&gt;SetFrameLineWidth(1);

// For the histo:
  // tdrStyle-&gt;SetHistFillColor(1);
  // tdrStyle-&gt;SetHistFillStyle(0);
  tdrStyle-&gt;SetHistLineColor(1);
  tdrStyle-&gt;SetHistLineStyle(0);
  tdrStyle-&gt;SetHistLineWidth(1);

  tdrStyle-&gt;SetEndErrorSize(2);
  //tdrStyle-&gt;SetErrorMarker(20);
  tdrStyle-&gt;SetErrorX(0.);

  tdrStyle-&gt;SetMarkerStyle(20);

//For the fit/function:
  tdrStyle-&gt;SetOptFit(1);
  tdrStyle-&gt;SetFitFormat("5.4g");
  tdrStyle-&gt;SetFuncColor(2);
  tdrStyle-&gt;SetFuncStyle(1);
  tdrStyle-&gt;SetFuncWidth(1);

//For the date:
  tdrStyle-&gt;SetOptDate(0);
  // tdrStyle-&gt;SetDateX(Float_t x = 0.01);
  // tdrStyle-&gt;SetDateY(Float_t y = 0.01);

// For the statistics box:
  tdrStyle-&gt;SetOptFile(0);
  tdrStyle-&gt;SetOptStat(0); // To display the mean and RMS:   SetOptStat("mr");
  tdrStyle-&gt;SetStatColor(kWhite);
  tdrStyle-&gt;SetStatFont(42);
  tdrStyle-&gt;SetStatFontSize(0.025);
  tdrStyle-&gt;SetStatTextColor(1);
  tdrStyle-&gt;SetStatFormat("6.4g");
  tdrStyle-&gt;SetStatBorderSize(1);
  tdrStyle-&gt;SetStatH(0.1);
  tdrStyle-&gt;SetStatW(0.15);
  // tdrStyle-&gt;SetStatStyle(Style_t style = 1001);
  // tdrStyle-&gt;SetStatX(Float_t x = 0);
  // tdrStyle-&gt;SetStatY(Float_t y = 0);

// Margins:
  tdrStyle-&gt;SetPadTopMargin(0.15);
  tdrStyle-&gt;SetPadBottomMargin(0.13);
  tdrStyle-&gt;SetPadLeftMargin(0.13);
  tdrStyle-&gt;SetPadRightMargin(0.15);

// For the Global title:

//  tdrStyle-&gt;SetOptTitle(0);
  tdrStyle-&gt;SetTitleFont(42);
  tdrStyle-&gt;SetTitleColor(1);
  tdrStyle-&gt;SetTitleTextColor(1);
  tdrStyle-&gt;SetTitleFillColor(10);
  tdrStyle-&gt;SetTitleFontSize(0.05);
  // tdrStyle-&gt;SetTitleH(0); // Set the height of the title box
  // tdrStyle-&gt;SetTitleW(0); // Set the width of the title box
  // tdrStyle-&gt;SetTitleX(0); // Set the position of the title box
  // tdrStyle-&gt;SetTitleY(0.985); // Set the position of the title box
  // tdrStyle-&gt;SetTitleStyle(Style_t style = 1001);
  // tdrStyle-&gt;SetTitleBorderSize(2);

// For the axis titles:

  tdrStyle-&gt;SetTitleColor(1, "XYZ");
  tdrStyle-&gt;SetTitleFont(42, "XYZ");
  tdrStyle-&gt;SetTitleSize(0.06, "XYZ");
// The inconsistency is great!
  tdrStyle-&gt;SetTitleXOffset(1.0);
  tdrStyle-&gt;SetTitleOffset(1.5, "Y"); 

// For the axis labels:

  tdrStyle-&gt;SetLabelColor(1, "XYZ");
  tdrStyle-&gt;SetLabelFont(42, "XYZ");
  tdrStyle-&gt;SetLabelOffset(0.007, "XYZ");
  tdrStyle-&gt;SetLabelSize(0.05, "XYZ");

// For the axis:

  tdrStyle-&gt;SetAxisColor(1, "XYZ");
  tdrStyle-&gt;SetStripDecimals(kTRUE);
  tdrStyle-&gt;SetTickLength(0.03, "XYZ");
  tdrStyle-&gt;SetNdivisions(510, "XYZ");
  tdrStyle-&gt;SetPadTickX(1);  // To get tick marks on the opposite side of the frame
  tdrStyle-&gt;SetPadTickY(1);

// Change for log plots:
  tdrStyle-&gt;SetOptLogx(0);
  tdrStyle-&gt;SetOptLogy(0);
  tdrStyle-&gt;SetOptLogz(0);

  tdrStyle-&gt;SetPalette(1,0);
  tdrStyle-&gt;cd();
}
</pre>
</div>
<p>
If your working with one of the major experiments, they'll most
likely have a style for you to use  (It will invariably be 95% the
same as above, but the 5% will make <b>all</b> the difference). 
</p>
</div>
</div>

<div id="outline-container-sec-1-9-7-2" class="outline-5">
<h5 id="sec-1-9-7-2">Transparent Plots</h5>
<div class="outline-text-5" id="text-1-9-7-2">
<p>
Add this to your <code>~/.rootrc</code> (or create it if it doesn't exist):
</p>
<pre class="example">
# GUI specific settings
Gui.Backend: qt
Gui.Factory: qt
</pre>
<p>
This sets the graphics backend to qt (you have to have built root with
qt support to use this feature).
</p>

<p>
Now, in your plotting code:
</p>
<div class="org-src-container">

<pre class="src src-cpp">TColor* color = gROOT-&gt;GetColor(TColor::GetColor(red,green,blue));//Use ints from 0 to 255 
color-&gt;SetAlpha(0.5);//0 is fully transparent, 1 fully opaque
hist-&gt;SetFillColor(color-&gt;GetNumber());
</pre>
</div>
<p>
Is this a clean interface? No, but it can be just what your graphic
needs to remain clear without cluttering the canvas with hatching. 
</p>

<p>
Two warnings:  
</p>
<ol class="org-ol">
<li>As of this writing, this is only supported for "popular" output
formats (pdf, svg, gif, jpg, and png), though notably <b>not</b>
postscript (ie ps). 
</li>
<li>It's very easy to create a shade that cannot be properly rendered
on a projector, making the transparent component of your plots
invisible.
</li>
<li>This only works with the latest version of ROOT 5.34
</li>
</ol>

<p>
More information:
</p>
<ul class="org-ul">
<li><a href="http://root.cern.ch/phpBB3/viewtopic.php?f=3&t=18100&p=76965">here</a>
</li>
</ul>
</div>
</div>
</div>
