index.org
*** Extending ROOT with custom classes
Sometimes it is useful to add your own developed classes to ROOT (so
they can be used in ROOT macros/PyROOT scripts or so they can be
stored in a ROOT file). For example you may have a class of the form
(in a file called CustomEvent.h, for example):
#+BEGIN_SRC cpp
  #ifndef CustomEvent_h
  #define CustomEvent_h

  #include "TObject.h"

  class CustomEvent : public TObject {
    ClassDef(CustomEvent,1);
  private:
    int    _eventID;
    double _eventEnergy;
  public:
    CustomEvent() {}
    virtual ~CustomEvent() {}

    void set_eventID(const int eid);
    void set_eventEnergy(const double e);

    int eventID() const { return _eventID; }
    double eventEnergy() const { return _eventEnergy; }
  };

  #endif
#+END_SRC
It is a good idea to inherit from TObject if you require reading or
writing objects to disk.  Official documentation of the ins and outs
of adding classes can be found in Chapter 15 of the [[https://root.cern.ch/drupal/content/root-users-guide-534][User's Guide]], as
well as information here: [[https://root.cern.ch/drupal/content/interacting-shared-libraries-rootcint][cint]] and [[https://root.cern.ch/drupal/content/adding-your-class-root-classdef][ClassDef]].  We also need
CustomEvent.cxx:
#+BEGIN_SRC cpp
#include "CustomEvent.h"

CustomEvent::CustomEvent() {}
CustomEvent::~CustomEvent() {}

void CustomEvent::set_eventID(const int eid) { _eventID = eid; }
void CustomEvent::set_eventEnergy(const double e) { _eventEnergy = e; }

#+END_SRC
To make this class accessible within (Py)ROOT you must create a LinkDef.h file
of the form:
#+BEGIN_SRC cpp
#ifdef __CINT__
#pragma link off all globals;
#pragma link off all classes;
#pragma link off all functions;

#pragma link C++ class CustomEvent+;

#endif
#+END_SRC
Now you must generate a dictionary for the class:
#+BEGIN_SRC sh
rootcint -f CustomEventDictionary.cxx -c CustomEvent.h LinkDef.h
#+END_SRC
This generates =CustomEventDictionary.cxx= and
=CustomEventDictionary.h=. Now you can compile the source for your
class and the new dictionary source. Then finally link them together
in a library:
#+BEGIN_SRC sh
g++ -fPIC -c CustomEvent.cxx `root-config --cflags`
g++ -fPIC -c CustomEventDictionary.cxx `root-config --cflags`
g++ -shared -o libCustomEvent.so CustomEvent.o CustomEventDictionary.o `root-config --glibs`
#+END_SRC
Now by loading the library libCustomEvent.so you can use your class
within ROOT. For example, the macro:
#+BEGIN_SRC cpp
{
  gSystem->Load("libCustomEvent");
  CustomEvent a;
  a.set_eventID(42);
  std::cout << a.eventID() << std::endl;
}
#+END_SRC
*** Important Gotcha's 
At some point you'll get stuck.  Hopefully you'll be stuck on a good
problem, but more often than not you'll be stuck on some quirk that
ROOT has.  Remember ROOT's mantra: "[[http://www.jargon.net/jargonfile/f/feature.html][It's not a bug, it's a feature]]!"

ROOT's object protocol is very strange.  The [[http://root.cern.ch/drupal/content/c-coding-conventions][naming schema]] is based on
an industry standard for C programs where it's not possible to use
namespaces. The result is very confusing for new users (very good for
HEP).  Every object in root that can be written to disk (ie saved in a
ROOT file) derives from a =TObject= base class.  This base class
defines a protocol for objects. (All objects can print themselves,
have a name, have a title, have a class name, etc).  This makes it
possible to have a list of disparate objects (as long as it's a list of
=TObject*=).  As you gain more experience with ROOT, this becomes
a power tool.  Like any power tool ([[https://en.wikipedia.org/wiki/List_of_Home_Improvement_characters#Tim_Taylor][as Tim Taylor can attest]]), this
can be abused to no end. 

**** TTrees
***** Drawing trees
When you call =TTree::Draw= to draw multi-dimensional histograms, the
order of the axes is "z:y:x" rather than the expected "x:y:z"
***** Caching trees
Use =TTreeCache= to loop over trees rather than the standard
=TTree::GetEntry(i)= idiom.  A =TTreeCache= learns which branches you
access most often and caches them, speeding up your processing time
significantly. [[http://root.cern.ch/root/html/TTreeCache.html][Documentation here]].  Since you won't read to the end
(no one does...) here is the docs for when *not* to use a
=TTreeCache=:
#+BEGIN_EXAMPLE
    SPECIAL CASES WHERE TreeCache should not be activated


   When reading only a small fraction of all entries such that not all branch
   buffers are read, it might be faster to run without a cache.


   HOW TO VERIFY That the TreeCache has been used and check its performance


  Once your analysis loop has terminated, you can access/print the number
  of effective system reads for a given file with a code like
  (where TFile* f is a pointer to your file)

   printf("Reading %lld bytes in %d transactions\n",f->GetBytesRead(),  f->GetReadCalls());
#+END_EXAMPLE
***** Splitting Trees
If you want to split a TTree into $n$ statistically independent
parts use something like:
#+BEGIN_SRC cpp
TTree* outTree=tree->CopyTree("Entry$%n==i");
#+END_SRC
Here, =n= is the number of parts requested, =i= is the i'th part.  If
you're just splitting it in half, a full blown macro (from the
trenches) would look like:
#+BEGIN_SRC cpp
// A macro to split a tree
{
  TFile* file=TFile::Open("./merged_dijets.root");
  TTree* tree=(TTree*)file->Get("micro");
  TFile* fileA=new TFile("UnfoldingStudy.dijets-pt1.root","RECREATE");
  fileA->cd();
  TTree* treeA=tree->CopyTree("Entry$%2==0");
  treeA->Write();
  fileA->Write();
  fileA->Close();
  TFile* fileB=new TFile("UnfoldingStudy.dijets-pt2.root","RECREATE");
  fileB->cd();
  TTree* treeB=tree->CopyTree("Entry$%2==1");
  treeB->Write();
  fileB->Write();
  fileB->Close();
  
}
#+END_SRC
**** TH1
Despite the name, TH1 is the base class for all histograms.  This can
lead to much [[http://dwarffortresswiki.org/index.php/DF2012:Losing][!FUN!]]. Be extra wary of null pointers when handling
TH1's of unknown origin.  
**** TH2
