docs/index.html

<div id="outline-container-sec-1-9-8" class="outline-4">
<h4 id="sec-1-9-8">Extending ROOT with custom classes</h4>
<div class="outline-text-4" id="text-1-9-8">
<p>
Sometimes it is useful to add your own developed classes to ROOT (so
they can be used in ROOT macros/PyROOT scripts or so they can be
stored in a ROOT file). For example you may have a class of the form
(in a file called CustomEvent.h, for example):
</p>
<div class="org-src-container">

<pre class="src src-cpp">#ifndef CustomEvent_h
#define CustomEvent_h

#include "TObject.h"

class CustomEvent : public TObject {
  ClassDef(CustomEvent,1);
private:
  int    _eventID;
  double _eventEnergy;
public:
  CustomEvent() {}
  virtual ~CustomEvent() {}

  void set_eventID(const int eid);
  void set_eventEnergy(const double e);

  int eventID() const { return _eventID; }
  double eventEnergy() const { return _eventEnergy; }
};

#endif
</pre>
</div>
<p>
It is a good idea to inherit from TObject if you require reading or
writing objects to disk.  Official documentation of the ins and outs
of adding classes can be found in Chapter 15 of the <a href="https://root.cern.ch/drupal/content/root-users-guide-534">User's Guide</a>, as
well as information here: <a href="https://root.cern.ch/drupal/content/interacting-shared-libraries-rootcint">cint</a> and <a href="https://root.cern.ch/drupal/content/adding-your-class-root-classdef">ClassDef</a>.  We also need
CustomEvent.cxx:
</p>
<div class="org-src-container">

<pre class="src src-cpp">#include "CustomEvent.h"

CustomEvent::CustomEvent() {}
CustomEvent::~CustomEvent() {}

void CustomEvent::set_eventID(const int eid) { _eventID = eid; }
void CustomEvent::set_eventEnergy(const double e) { _eventEnergy = e; }
</pre>
</div>
<p>
To make this class accessible within (Py)ROOT you must create a LinkDef.h file
of the form:
</p>
<div class="org-src-container">

<pre class="src src-cpp">#ifdef __CINT__
#pragma link off all globals;
#pragma link off all classes;
#pragma link off all functions;

#pragma link C++ class CustomEvent+;

#endif
</pre>
</div>
<p>
Now you must generate a dictionary for the class:
</p>
<div class="org-src-container">

<pre class="src src-sh">rootcint -f CustomEventDictionary.cxx -c CustomEvent.h LinkDef.h
</pre>
</div>
<p>
This generates <code>CustomEventDictionary.cxx</code> and
<code>CustomEventDictionary.h</code>. Now you can compile the source for your
class and the new dictionary source. Then finally link them together
in a library:
</p>
<div class="org-src-container">

<pre class="src src-sh">g++ -fPIC -c CustomEvent.cxx `root-config --cflags`
g++ -fPIC -c CustomEventDictionary.cxx `root-config --cflags`
g++ -shared -o libCustomEvent.so CustomEvent.o CustomEventDictionary.o `root-config --glibs`
</pre>
</div>
<p>
Now by loading the library libCustomEvent.so you can use your class
within ROOT. For example, the macro:
</p>
<div class="org-src-container">

<pre class="src src-cpp">{
  gSystem-&gt;Load("libCustomEvent");
  CustomEvent a;
  a.set_eventID(42);
  std::cout &lt;&lt; a.eventID() &lt;&lt; std::endl;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-9-9" class="outline-4">
<h4 id="sec-1-9-9">Important Gotcha's</h4>
<div class="outline-text-4" id="text-1-9-9">
<p>
At some point you'll get stuck.  Hopefully you'll be stuck on a good
problem, but more often than not you'll be stuck on some quirk that
ROOT has.  Remember ROOT's mantra: "<a href="http://www.jargon.net/jargonfile/f/feature.html">It's not a bug, it's a feature</a>!"
</p>

<p>
ROOT's object protocol is very strange.  The <a href="http://root.cern.ch/drupal/content/c-coding-conventions">naming schema</a> is based on
an industry standard for C programs where it's not possible to use
namespaces. The result is very confusing for new users (very good for
HEP).  Every object in root that can be written to disk (ie saved in a
ROOT file) derives from a <code>TObject</code> base class.  This base class
defines a protocol for objects. (All objects can print themselves,
have a name, have a title, have a class name, etc).  This makes it
possible to have a list of disparate objects (as long as it's a list of
<code>TObject*</code>).  As you gain more experience with ROOT, this becomes
a power tool.  Like any power tool (<a href="https://en.wikipedia.org/wiki/List_of_Home_Improvement_characters#Tim_Taylor">as Tim Taylor can attest</a>), this
can be abused to no end. 
</p>
</div>

<div id="outline-container-sec-1-9-9-1" class="outline-5">
<h5 id="sec-1-9-9-1">TTrees</h5>
<div class="outline-text-5" id="text-1-9-9-1">
</div><div id="outline-container-sec-1-9-9-1-1" class="outline-6">
<h6 id="sec-1-9-9-1-1">Drawing trees</h6>
<div class="outline-text-6" id="text-1-9-9-1-1">
<p>
When you call <code>TTree::Draw</code> to draw multi-dimensional histograms, the
order of the axes is "z:y:x" rather than the expected "x:y:z"
</p>
</div>
</div>
<div id="outline-container-sec-1-9-9-1-2" class="outline-6">
<h6 id="sec-1-9-9-1-2">Caching trees</h6>
<div class="outline-text-6" id="text-1-9-9-1-2">
<p>
Use <code>TTreeCache</code> to loop over trees rather than the standard
<code>TTree::GetEntry(i)</code> idiom.  A <code>TTreeCache</code> learns which branches you
access most often and caches them, speeding up your processing time
significantly. <a href="http://root.cern.ch/root/html/TTreeCache.html">Documentation here</a>.  Since you won't read to the end
(no one does&#x2026;) here is the docs for when <b>not</b> to use a
<code>TTreeCache</code>:
</p>
<pre class="example">
  SPECIAL CASES WHERE TreeCache should not be activated


 When reading only a small fraction of all entries such that not all branch
 buffers are read, it might be faster to run without a cache.


 HOW TO VERIFY That the TreeCache has been used and check its performance


Once your analysis loop has terminated, you can access/print the number
of effective system reads for a given file with a code like
(where TFile* f is a pointer to your file)

 printf("Reading %lld bytes in %d transactions\n",f-&gt;GetBytesRead(),  f-&gt;GetReadCalls());
</pre>
</div>
</div>
<div id="outline-container-sec-1-9-9-1-3" class="outline-6">
<h6 id="sec-1-9-9-1-3">Splitting Trees</h6>
<div class="outline-text-6" id="text-1-9-9-1-3">
<p>
If you want to split a TTree into \(n\) statistically independent
parts use something like:
</p>
<div class="org-src-container">

<pre class="src src-cpp">TTree* outTree=tree-&gt;CopyTree("Entry$%n==i");
</pre>
</div>
<p>
Here, <code>n</code> is the number of parts requested, <code>i</code> is the i'th part.  If
you're just splitting it in half, a full blown macro (from the
trenches) would look like:
</p>
<div class="org-src-container">

<pre class="src src-cpp">// A macro to split a tree
{
  TFile* file=TFile::Open("./merged_dijets.root");
  TTree* tree=(TTree*)file-&gt;Get("micro");
  TFile* fileA=new TFile("UnfoldingStudy.dijets-pt1.root","RECREATE");
  fileA-&gt;cd();
  TTree* treeA=tree-&gt;CopyTree("Entry$%2==0");
  treeA-&gt;Write();
  fileA-&gt;Write();
  fileA-&gt;Close();
  TFile* fileB=new TFile("UnfoldingStudy.dijets-pt2.root","RECREATE");
  fileB-&gt;cd();
  TTree* treeB=tree-&gt;CopyTree("Entry$%2==1");
  treeB-&gt;Write();
  fileB-&gt;Write();
  fileB-&gt;Close();

}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-9-9-2" class="outline-5">
<h5 id="sec-1-9-9-2">TH1</h5>
<div class="outline-text-5" id="text-1-9-9-2">
<p>
Despite the name, TH1 is the base class for all histograms.  This can
lead to much <a href="http://dwarffortresswiki.org/index.php/DF2012:Losing">!FUN!</a>. Be extra wary of null pointers when handling
TH1's of unknown origin.  
</p>
</div>
</div>
