index.org
***** Splitting a 2D 
One would expect an interface method like =TH2D::Split()=, but instead
you need to use the appropriate THStack [[http://root.cern.ch/root/html/THStack.html#THStack:THStack@2][constructor]]:
=THStack(const TH1* hist, Option_t* axis = "x", ...)=

Then call =THStack::GetHists= to get a TList of the histograms.  Of
course, you'll have to use [[http://root.cern.ch/root/html/TList.html][ROOT's idioms for iterating over lists]],

Another, slightly more direct option is =TH2::ProjectionX()= and
=TH2::ProjectionY()=, used in the following fashion:
#+BEGIN_SRC cpp
  std::vector<TH1D*> split_list;
  for(size_t i = 1; i < Hist2D->GetNbinsX()+1; i++) {
    split_list.push_back(Hist2D->ProjectionY("_py",i,i+1,"e"));
  }
#+END_SRC
Depending on your ROOT version, you may have to change the ="_py"=
string to be something unique.  This can be done as follows:
#+BEGIN_SRC cpp
  std::vector<TH1D*> split_list;
  char buff[256];
  for(size_t i = 1; i < Hist2D->GetNbinsX()+1; i++) {
    snprintf(buff,sizeof(buff)/sizeof(*buff),"%s_%u_py",Hist2D->GetName(),i);
    split_list.push_back(Hist2D->ProjectionY(buff,i,i+1,"e"));
  }
#+END_SRC
User Beware: not using a unique name can cause unexpected behavior
when drawing the list of slices.  
**** THStack
=THStack= is not mostly harmless. In fact, if you want to do reasonable
things with =THStack=, it probably won't work, and if it does, it may
work once and not the second time.  If you can avoid =THStack=, then do
it.  
***** Get Sum of Stack 
To get a histogram representing the sum of a stack use
=THStack::GetStack()->Last()=
***** A pointer here, a pointer there, who am I?
If you want to iterate over the stack, there are two ways to get the
underlying objects.  They are not equal.  Option 1:
#+BEGIN_SRC cpp
  THStack stack = new THStack("Stack","A stack of histograms");
  // later on ...
  TIter next(stack->GetHists());
  TH1* hist = NULL;
  while((hist=dynamic_cast<TH1*>(next()))){
    // Do something with *original* histograms added to stack
  }
#+END_SRC
Option 2:
#+BEGIN_SRC cpp
  TH1* hist = NULL;
  for(int i = 0; i < stack->GetStack()->GetEntries(); i++){
    hist = dynamic_cast<TH1*>(stack->GetStack()->At(i));
    // Do something with histograms to be painted on the canvas
  }
#+END_SRC
These two methods appear equal but are not.  The =TList= method from
=THStack::GetHists= give you the original pointers (ie those that you
added with =THStack::Add=).  The =TObjArray= method from
=THStack::GetStack= gives you the internal histograms which will be
used to draw the histograms on the canvas.
**** TFile
TFile's are greedy about object ownership.  In fact, object ownership
in ROOT is a very common +bug+ feature.  Many times you'll own objects
you thought you didn't (memory leak) or, you'll delete objects you
thought you did (double free core-dump). 

The rule of thumb to keep in mind is "TObjects declared after a file
is opened are owned by previously opened file" 

Contrast:
#+BEGIN_SRC cpp 
TH1F hist("hist","Higgs Discovery Plot", 50,0,200);
TFile output("discovery.root","RECREATE");
output.Close();
#+END_SRC
with:
#+BEGIN_SRC cpp 
TFile output("discovery.root","RECREATE");
TH1F hist("hist","Higgs Discovery Plot", 50,0,200);
output.Close();
#+END_SRC

In the former, the file =discovery.root= will be empty.  In the
latter, it will contain a copy of =hist=.  

This can get really hairy when you're dealing with pointers.
Therefore (instead of being a responsible programmer), the best
approach to managing memory in ROOT is to not manage it until you
have to.  
***** Recreate, create, new, update
From the ROOT docs:
#+BEGIN_EXAMPLE
If option = NEW or CREATE   create a new file and open it for writing,
                             if the file already exists the file is
                             not opened.
           = RECREATE        create a new file, if the file already
                             exists it will be overwritten.
           = UPDATE          open an existing file for writing.
                             if no file exists, it is created.
           = READ            open an existing file for reading (default).
#+END_EXAMPLE
*Important*: Recreating will destroy the file if it exists.  BE
CAREFUL when you use this option!
**** Extracting ACLiCs compilation steps
Here's a tip you hope you never need.  The use case is when you are
writing a standalone program and you know you need to invoke rootcint
to generate dictionaries. When you follow the [[https://root.cern.ch/drupal/content/interacting-shared-libraries-rootcint][correct prescription]],
the produced dictionary fails even when linked to your code.  What you
can do is follow the "[[https://root.cern.ch/phpBB3/viewtopic.php?f%3D3&t%3D10236&p%3D83570#p44117][loader.C prescription]]" and then dump what ACLiC
is doing under the hood with:
#+BEGIN_EXAMPLE
root [7] gDebug=7
(const int)7
root [8] .L libLoader.C++
#+END_EXAMPLE
This will dump all of the g++ and rootcint calls that are required to
generate a working dictionary.
*** Debugging with ROOT
Eventually you'll encounter a segmentation fault or segfault in ROOT.
(They can also go under the name core dump).  This happens when you
try to read, write, or otherwise abuse a part of memory that doesn't
belong to you.  The result is that the program (ROOT usually)
crashes.  ROOT has gotten pretty good at realizing that this has
happened, and printing information about what was going on when the
crash happened.  
