docs/index.html
<div id="outline-container-sec-1-9-9-3" class="outline-5">
<h5 id="sec-1-9-9-3">TH2</h5>
<div class="outline-text-5" id="text-1-9-9-3">
</div><div id="outline-container-sec-1-9-9-3-1" class="outline-6">
<h6 id="sec-1-9-9-3-1">Splitting a 2D</h6>
<div class="outline-text-6" id="text-1-9-9-3-1">
<p>
One would expect an interface method like <code>TH2D::Split()</code>, but instead
you need to use the appropriate THStack <a href="http://root.cern.ch/root/html/THStack.html#THStack:THStack@2">constructor</a>:
<code>THStack(const TH1* hist, Option_t* axis = "x", ...)</code>
</p>

<p>
Then call <code>THStack::GetHists</code> to get a TList of the histograms.  Of
course, you'll have to use <a href="http://root.cern.ch/root/html/TList.html">ROOT's idioms for iterating over lists</a>,
</p>

<p>
Another, slightly more direct option is <code>TH2::ProjectionX()</code> and
<code>TH2::ProjectionY()</code>, used in the following fashion:
</p>
<div class="org-src-container">

<pre class="src src-cpp">std::vector&lt;TH1D*&gt; split_list;
for(size_t i = 1; i &lt; Hist2D-&gt;GetNbinsX()+1; i++) {
  split_list.push_back(Hist2D-&gt;ProjectionY("_py",i,i+1,"e"));
}
</pre>
</div>
<p>
Depending on your ROOT version, you may have to change the ="<sub>py</sub>"=
string to be something unique.  This can be done as follows:
</p>
<div class="org-src-container">

<pre class="src src-cpp">std::vector&lt;TH1D*&gt; split_list;
char buff[256];
for(size_t i = 1; i &lt; Hist2D-&gt;GetNbinsX()+1; i++) {
  snprintf(buff,sizeof(buff)/sizeof(*buff),"%s_%u_py",Hist2D-&gt;GetName(),i);
  split_list.push_back(Hist2D-&gt;ProjectionY(buff,i,i+1,"e"));
}
</pre>
</div>
<p>
User Beware: not using a unique name can cause unexpected behavior
when drawing the list of slices.  
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-9-9-4" class="outline-5">
<h5 id="sec-1-9-9-4">THStack</h5>
<div class="outline-text-5" id="text-1-9-9-4">
<p>
<code>THStack</code> is not mostly harmless. In fact, if you want to do reasonable
things with <code>THStack</code>, it probably won't work, and if it does, it may
work once and not the second time.  If you can avoid <code>THStack</code>, then do
it.  
</p>
</div>
<div id="outline-container-sec-1-9-9-4-1" class="outline-6">
<h6 id="sec-1-9-9-4-1">Get Sum of Stack</h6>
<div class="outline-text-6" id="text-1-9-9-4-1">
<p>
To get a histogram representing the sum of a stack use
<code>THStack::GetStack()-&gt;Last()</code>
</p>
</div>
</div>
<div id="outline-container-sec-1-9-9-4-2" class="outline-6">
<h6 id="sec-1-9-9-4-2">A pointer here, a pointer there, who am I?</h6>
<div class="outline-text-6" id="text-1-9-9-4-2">
<p>
If you want to iterate over the stack, there are two ways to get the
underlying objects.  They are not equal.  Option 1:
</p>
<div class="org-src-container">

<pre class="src src-cpp">THStack stack = new THStack("Stack","A stack of histograms");
// later on ...
TIter next(stack-&gt;GetHists());
TH1* hist = NULL;
while((hist=dynamic_cast&lt;TH1*&gt;(next()))){
  // Do something with *original* histograms added to stack
}
</pre>
</div>
<p>
Option 2:
</p>
<div class="org-src-container">

<pre class="src src-cpp">TH1* hist = NULL;
for(int i = 0; i &lt; stack-&gt;GetStack()-&gt;GetEntries(); i++){
  hist = dynamic_cast&lt;TH1*&gt;(stack-&gt;GetStack()-&gt;At(i));
  // Do something with histograms to be painted on the canvas
}
</pre>
</div>
<p>
These two methods appear equal but are not.  The <code>TList</code> method from
<code>THStack::GetHists</code> give you the original pointers (ie those that you
added with <code>THStack::Add</code>).  The <code>TObjArray</code> method from
<code>THStack::GetStack</code> gives you the internal histograms which will be
used to draw the histograms on the canvas.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-9-9-5" class="outline-5">
<h5 id="sec-1-9-9-5">TFile</h5>
<div class="outline-text-5" id="text-1-9-9-5">
<p>
TFile's are greedy about object ownership.  In fact, object ownership
in ROOT is a very common <del>bug</del> feature.  Many times you'll own objects
you thought you didn't (memory leak) or, you'll delete objects you
thought you did (double free core-dump). 
</p>

<p>
The rule of thumb to keep in mind is "TObjects declared after a file
is opened are owned by previously opened file" 
</p>

<p>
Contrast:
</p>
<div class="org-src-container">

<pre class="src src-cpp">TH1F hist("hist","Higgs Discovery Plot", 50,0,200);
TFile output("discovery.root","RECREATE");
output.Close();
</pre>
</div>
<p>
with:
</p>
<div class="org-src-container">

<pre class="src src-cpp">TFile output("discovery.root","RECREATE");
TH1F hist("hist","Higgs Discovery Plot", 50,0,200);
output.Close();
</pre>
</div>

<p>
In the former, the file <code>discovery.root</code> will be empty.  In the
latter, it will contain a copy of <code>hist</code>.  
</p>

<p>
This can get really hairy when you're dealing with pointers.
Therefore (instead of being a responsible programmer), the best
approach to managing memory in ROOT is to not manage it until you
have to.  
</p>
</div>
<div id="outline-container-sec-1-9-9-5-1" class="outline-6">
<h6 id="sec-1-9-9-5-1">Recreate, create, new, update</h6>
<div class="outline-text-6" id="text-1-9-9-5-1">
<p>
From the ROOT docs:
</p>
<pre class="example">
If option = NEW or CREATE   create a new file and open it for writing,
                             if the file already exists the file is
                             not opened.
           = RECREATE        create a new file, if the file already
                             exists it will be overwritten.
           = UPDATE          open an existing file for writing.
                             if no file exists, it is created.
           = READ            open an existing file for reading (default).
</pre>
<p>
<b>Important</b>: Recreating will destroy the file if it exists.  BE
CAREFUL when you use this option!
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-9-9-6" class="outline-5">
<h5 id="sec-1-9-9-6">Extracting ACLiCs compilation steps</h5>
<div class="outline-text-5" id="text-1-9-9-6">
<p>
Here's a tip you hope you never need.  The use case is when you are
writing a standalone program and you know you need to invoke rootcint
to generate dictionaries. When you follow the <a href="https://root.cern.ch/drupal/content/interacting-shared-libraries-rootcint">correct prescription</a>,
the produced dictionary fails even when linked to your code.  What you
can do is follow the "<a href="https://root.cern.ch/phpBB3/viewtopic.php?f=3&t=10236&p=83570#p44117">loader.C prescription</a>" and then dump what ACLiC
is doing under the hood with:
</p>
<pre class="example">
root [7] gDebug=7
(const int)7
root [8] .L libLoader.C++
</pre>
<p>
This will dump all of the g++ and rootcint calls that are required to
generate a working dictionary.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-9-10" class="outline-4">
<h4 id="sec-1-9-10">Debugging with ROOT</h4>
<div class="outline-text-4" id="text-1-9-10">
<p>
Eventually you'll encounter a segmentation fault or segfault in ROOT.
(They can also go under the name core dump).  This happens when you
try to read, write, or otherwise abuse a part of memory that doesn't
belong to you.  The result is that the program (ROOT usually)
crashes.  ROOT has gotten pretty good at realizing that this has
happened, and printing information about what was going on when the
crash happened.  
</p>
</div>
