index.org
**** A "crash" course on reading a stack trace
Here's a stack trace from a real-live analysis program (SFrame in this
case)
#+BEGIN_EXAMPLE



===========================================================
There was a crash.
This is the entire stack trace of all threads:
===========================================================
#0  0x0000003ba7e9a075 in waitpid () from /lib64/libc.so.6
#1  0x0000003ba7e3c741 in do_system () from /lib64/libc.so.6
#2  0x00002b4f86156256 in TUnixSystem::StackTrace() ()
   from /cvmfs/atlas.cern.ch/repo/ATLASLocalRootBase/x86_64/root/5.34.07-x86_64-slc5-gcc4.3/lib/libCore.so
#3  0x00002b4f86155b2c in TUnixSystem::DispatchSignals(ESignals) ()
   from /cvmfs/atlas.cern.ch/repo/ATLASLocalRootBase/x86_64/root/5.34.07-x86_64-slc5-gcc4.3/lib/libCore.so
#4  <signal handler called>
#5  0x00002b4f93f9a47d in UnfoldingStudy::ExecuteEvent(SInputData const&, double) () from /home/dmb60/bFrame/SFrame/lib/libMiniReaders.so
#6  0x00002b4f85c33616 in SCycleBaseExec::Process(long long) ()
   from /home/dmb60/bFrame/SFrame/lib/libSFrameCore.so
#7  0x00002b4f8a62e1e0 in TTreePlayer::Process(TSelector*, char const*, long long, long long) ()
   from /cvmfs/atlas.cern.ch/repo/ATLASLocalRootBase/x86_64/root/5.34.07-x86_64-slc5-gcc4.3/lib/libTreePlayer.so
#8  0x00002b4f85c47ce8 in SCycleController::ExecuteNextCycle() ()
   from /home/dmb60/bFrame/SFrame/lib/libSFrameCore.so
#9  0x00002b4f85c43872 in SCycleController::ExecuteAllCycles() ()
   from /home/dmb60/bFrame/SFrame/lib/libSFrameCore.so
#10 0x000000000040226c in main ()
===========================================================


The lines below might hint at the cause of the crash.
If they do not help you then please submit a bug report at
http://root.cern.ch/bugs. Please post the ENTIRE stack trace
from above as an attachment in addition to anything else
that might help us fixing this issue.
===========================================================
#5  0x00002b4f93f9a47d in UnfoldingStudy::ExecuteEvent(SInputData const&, double) () from /home/dmb60/bFrame/SFrame/lib/libMiniReaders.so
#6  0x00002b4f85c33616 in SCycleBaseExec::Process(long long) ()
   from /home/dmb60/bFrame/SFrame/lib/libSFrameCore.so
#7  0x00002b4f8a62e1e0 in TTreePlayer::Process(TSelector*, char const*, long long, long long) ()
   from /cvmfs/atlas.cern.ch/repo/ATLASLocalRootBase/x86_64/root/5.34.07-x86_64-slc5-gcc4.3/lib/libTreePlayer.so
#8  0x00002b4f85c47ce8 in SCycleController::ExecuteNextCycle() ()
   from /home/dmb60/bFrame/SFrame/lib/libSFrameCore.so
#9  0x00002b4f85c43872 in SCycleController::ExecuteAllCycles() ()
   from /home/dmb60/bFrame/SFrame/lib/libSFrameCore.so
#10 0x000000000040226c in main ()
===========================================================



#+END_EXAMPLE
The numbered lines followed by the memory address (the 64bit hex
numbers) represent the order in which each function was called.  The
most recent call is at the top of the list.  Since this code was
running a single thread, there is a only one stack trace. If there
were multiple threads, there would be a trace for each
thread. Typically the fastest route to a user called function is to
look at the portion:
#+BEGIN_EXAMPLE
The lines below might hint at the cause of the crash.
If they do not help you then please submit a bug report at
http://root.cern.ch/bugs. Please post the ENTIRE stack trace
from above as an attachment in addition to anything else
that might help us fixing this issue.
===========================================================
#5  0x00002b4f93f9a47d in UnfoldingStudy::ExecuteEvent(SInputData const&, double) () from /home/dmb60/bFrame/SFrame/lib/libMiniReaders.so
#6  0x00002b4f85c33616 in SCycleBaseExec::Process(long long) ()
   from /home/dmb60/bFrame/SFrame/lib/libSFrameCore.so
#7  0x00002b4f8a62e1e0 in TTreePlayer::Process(TSelector*, char const*, long long, long long) ()
   from /cvmfs/atlas.cern.ch/repo/ATLASLocalRootBase/x86_64/root/5.34.07-x86_64-slc5-gcc4.3/lib/libTreePlayer.so
#8  0x00002b4f85c47ce8 in SCycleController::ExecuteNextCycle() ()
   from /home/dmb60/bFrame/SFrame/lib/libSFrameCore.so
#9  0x00002b4f85c43872 in SCycleController::ExecuteAllCycles() ()
   from /home/dmb60/bFrame/SFrame/lib/libSFrameCore.so
#10 0x000000000040226c in main ()
===========================================================
#+END_EXAMPLE

This strips out the system calls that clutter the full trace, and the
top frame (#5 in this case) is the last function called that was
defined (=UnfoldingStudy::ExecuteEvent=).  This means that somewhere in
that function, someone tried to access memory they shouldn't have.  

You can trace the whole program from the =main()= invocation.  To
gain more insight into all the information contained in the stack
trace, it is very useful to go through a =gdb= tutorial.  

Also, see [[*Getting%20Help][Getting Help]] for more problem solving strategies before
filing a bug report.  Remember: you probably just found a feature,
not a bug.   

**** Using gdb
Here are some good gdb (GNU DeBugger) tutorials 
- [[https://www.cs.cmu.edu/~gilpin/tutorial/][Debugging under Unix: gdb Tutorial]]
- [[http://www.unknownroad.com/rtfm/gdbtut/gdbtoc.html][RMS's gdb Debugger Tutorial]] (not the same [[http://stallman.org/][RMS]])
- [[https://www.gnu.org/software/gdb/documentation/][GDB manual]] from GNU.org
- [[http://www.muenster.de/~naumana/rootgdb.html][Debugging ROOT with GDB]], somewhat dated but the information is
  relevant.  Written by Axel Naumann, a real-life ROOT hacker!

**** Valgrind
If you have memory related problems, you should be aware of
[[valgrind.org][valgrind]].  The [[http://valgrind.org/docs/manual/QuickStart.html][quick-start is here]].

** Physics
At some point (not necessarily right away) a hitchhiker will want to
better understand the physics underlying the research he/she is
doing.  There are numerous textbooks on the subject, but a few stand
out as particularly good.
- [[http://www.amazon.com/Introduction-Elementary-Particles-David-Griffiths/dp/3527406018/ref%3Dpd_sim_b_1?ie%3DUTF8&refRID%3D1S6X949W6P9EM9E95V8A][Introduction to Elementary Particles 2nd Ed.]] - David Griffiths
- [[http://www.amazon.com/Quarks-Leptons-Introductory-Particle-Physics/dp/0471887412][Quarks and Leptons: An Introductory Course in Modern Particle]]
  Physics - Francis Halzen and Alan D. Martin
