index.org
**** Flat text file
One option is to keep a (well organized) text file for recording what
you're doing.  Paste links and your thoughts here.  Choose a markdown
language and write your posts in that.  This way you are forced to
keep more structure in the file, and you can export to whatever
output formats are supported by your markdown language.
**** Wiki/ELog
Some research groups reserve webspace for hosting private
e-logs. These are typically wiki syntax, but they can also be
bulletin board style formatting.  In any case, it's possible to use a
browser extension like "[[https://addons.mozilla.org/en-US/firefox/addon/its-all-text/][It's All Text!]]"  to use your favorite
editor. One downside to these style notebooks is that it is typically
awkward to post many plots at once. 

** Getting Help
For better or worse, eventually you will get stuck.  This is
Research! If you're not stuck half the time you're not doing it
right! 

Here's a rough strategy for tackling problems:
1. Google it, don't just Google specific errors, search related terms.
   Eventually you will be able to make the search more and more
   general until you get the answer you want, try reading the [[http://www.googleguide.com/][Google
   guide]].
2. Read documentation. Many times the answer is buried deep inside
   the program.  Don't be afraid to crack open the source code and
   actually try to understand whats going on (after exhausting any
   manuals or user guides available).
3. Just take a deep breath, go get a cup of coffee and come back
   to the problem.
4. If the coffee didn't help, table the problem for the moment and
   work on something else.  Most likely when you come back to it
   (today or tomorrow) the solution will be obvious.
   - Now may be an appropriate time for an email to the person you
     are working with directly.  Chances are they've already
     encountered and solved your problem.
5. If you're still stuck, it may be time to post to a forum or mailing
   list.  In general, when soliciting help from people you don't
   know, it is polite to avoid contacting them directly.
   - Above all else, *do not* be a [[http://slash7.com/2006/12/22/vampires/][help vampire]].  (They do exist!)

** FAQ
- I tried: =#include <TheAnswerIsFortyTwo.h>= in C++ but it
  doesn't work, what gives?
In short: "=#include <...>=" instructs the compiler to look in
specific system include directories.  In contrast '=#include= "=...="'
instructs the compiler to look in all directories that it can find
(usually specified with the =-I= flag). ([[http://www.cplusplus.com/forum/beginner/43444/][Further information]])
- I was typing along and all of the sudden my terminal froze!? The
  only way to continue was to exit the program! 
Most likely you accidentally typed "C-s" (the control key followed by
the s key). This sends the XOFF command to your terminal emulator.
To fix it (and "unfreeze" your terminal) type "C-q". [[https://en.wikipedia.org/wiki/Software_flow_control][More Info Here]].
- Dear Mr. The Editor, my <insert problem here>, can you fix it?
No. Please refer to [[*Getting%20Help][Getting Help]].
- I have some information that would be useful for your guide, can
  you use it?
Yes! Please see [[https://github.com/dbjergaard/hitchhikers-guide-to-hep#contributing][Contributing]]. 
- I'm lost and confused, your guide is overwhelming and overbearing,
  but I really like HEP, what can I do?
Please don't despair, with time things will come into focus.  In the
mean time, it will probably be useful to seek out other sources of
information.  If you're having trouble finding material, you might
try the [[http://www.googleguide.com/][Google guide]].  No, this is not intended to be an insult, a
surprising fraction of people don't know how to use Google, even
though it's a verb.
- I have a question not covered by this FAQ that doesn't involve a
  research problem, whats the best way to communicate it to you?  
You can email me at [[mailto:david.b@duke.edu][david.b@duke.edu]]. If it is related to some
technical issue and you already have a GitHub account, please open an
issue on GitHub's issue [[https://github.com/dbjergaard/hitchhikers-guide-to-hep/issues][tracker for this text]].
