docs/index.html
<div id="outline-container-sec-1-11-1-3" class="outline-5">
<h5 id="sec-1-11-1-3">Flat text file</h5>
<div class="outline-text-5" id="text-1-11-1-3">
<p>
One option is to keep a (well organized) text file for recording what
you're doing.  Paste links and your thoughts here.  Choose a markdown
language and write your posts in that.  This way you are forced to
keep more structure in the file, and you can export to whatever
output formats are supported by your markdown language.
</p>
</div>
</div>
<div id="outline-container-sec-1-11-1-4" class="outline-5">
<h5 id="sec-1-11-1-4">Wiki/ELog</h5>
<div class="outline-text-5" id="text-1-11-1-4">
<p>
Some research groups reserve webspace for hosting private
e-logs. These are typically wiki syntax, but they can also be
bulletin board style formatting.  In any case, it's possible to use a
browser extension like "<a href="https://addons.mozilla.org/en-US/firefox/addon/its-all-text/">It's All Text!</a>"  to use your favorite
editor. One downside to these style notebooks is that it is typically
awkward to post many plots at once. 
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12">Getting Help</h3>
<div class="outline-text-3" id="text-1-12">
<p>
For better or worse, eventually you will get stuck.  This is
Research! If you're not stuck half the time you're not doing it
right! 
</p>

<p>
Here's a rough strategy for tackling problems:
</p>
<ol class="org-ol">
<li>Google it, don't just Google specific errors, search related terms.
Eventually you will be able to make the search more and more
general until you get the answer you want, try reading the <a href="http://www.googleguide.com/">Google
guide</a>.
</li>
<li>Read documentation. Many times the answer is buried deep inside
the program.  Don't be afraid to crack open the source code and
actually try to understand whats going on (after exhausting any
manuals or user guides available).
</li>
<li>Just take a deep breath, go get a cup of coffee and come back
to the problem.
</li>
<li>If the coffee didn't help, table the problem for the moment and
work on something else.  Most likely when you come back to it
(today or tomorrow) the solution will be obvious.
<ul class="org-ul">
<li>Now may be an appropriate time for an email to the person you
are working with directly.  Chances are they've already
encountered and solved your problem.
</li>
</ul>
</li>
<li>If you're still stuck, it may be time to post to a forum or mailing
list.  In general, when soliciting help from people you don't
know, it is polite to avoid contacting them directly.
<ul class="org-ul">
<li>Above all else, <b>do not</b> be a <a href="http://slash7.com/2006/12/22/vampires/">help vampire</a>.  (They do exist!)
</li>
</ul>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13">FAQ</h3>
<div class="outline-text-3" id="text-1-13">
<ul class="org-ul">
<li>I tried: <code>#include &lt;TheAnswerIsFortyTwo.h&gt;</code> in C++ but it
doesn't work, what gives?
</li>
</ul>
<p>
In short: "<code>#include &lt;...&gt;</code>" instructs the compiler to look in
specific system include directories.  In contrast '<code>#include</code> "<code>...</code>"'
instructs the compiler to look in all directories that it can find
(usually specified with the <code>-I</code> flag). (<a href="http://www.cplusplus.com/forum/beginner/43444/">Further information</a>)
</p>
<ul class="org-ul">
<li>I was typing along and all of the sudden my terminal froze!? The
only way to continue was to exit the program! 
</li>
</ul>
<p>
Most likely you accidentally typed "C-s" (the control key followed by
the s key). This sends the XOFF command to your terminal emulator.
To fix it (and "unfreeze" your terminal) type "C-q". <a href="https://en.wikipedia.org/wiki/Software_flow_control">More Info Here</a>.
</p>
<ul class="org-ul">
<li>Dear Mr. The Editor, my &lt;insert problem here&gt;, can you fix it?
</li>
</ul>
<p>
No. Please refer to <a href="#sec-1-12">Getting Help</a>.
</p>
<ul class="org-ul">
<li>I have some information that would be useful for your guide, can
you use it?
</li>
</ul>
<p>
Yes! Please see <a href="https://github.com/dbjergaard/hitchhikers-guide-to-hep#contributing">Contributing</a>. 
</p>
<ul class="org-ul">
<li>I'm lost and confused, your guide is overwhelming and overbearing,
but I really like HEP, what can I do?
</li>
</ul>
<p>
Please don't despair, with time things will come into focus.  In the
mean time, it will probably be useful to seek out other sources of
information.  If you're having trouble finding material, you might
try the <a href="http://www.googleguide.com/">Google guide</a>.  No, this is not intended to be an insult, a
surprising fraction of people don't know how to use Google, even
though it's a verb.
</p>
<ul class="org-ul">
<li>I have a question not covered by this FAQ that doesn't involve a
research problem, whats the best way to communicate it to you?  
</li>
</ul>
<p>
You can email me at <a href="mailto:david.b@duke.edu">david.b@duke.edu</a>. If it is related to some
technical issue and you already have a GitHub account, please open an
issue on GitHub's issue <a href="https://github.com/dbjergaard/hitchhikers-guide-to-hep/issues">tracker for this text</a>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Bjergaard</p>
<p class="date">Created: 2017-01-23 Mon 13:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
